[
  {
    "id": 1,
    "name": "乾为天",
    "hexagramSymbol": "䷀",
    "yaos": [
      "阳",
      "阳",
      "阳",
      "阳",
      "阳",
      "阳"
    ],
    "yaoci": [
      "初九：潜龙勿用。",
      "九二：见龙在田，利见大人。",
      "九三：君子终日干干，夕惕若厉，无咎。",
      "九四：或跃在渊，无咎。",
      "九五：飞龙在天，利见大人。",
      "上九：亢龙有悔。"
    ],
    "divinationDiagramName": "乾为天象解",
    "divinationDiagram": "鹿在云中，石上玉，有光明，人琢玉。月当空，官人登云梯，望月。\n六龙御天之课 广大包容之",
    "explanation": "【卦象描述】乾为天䷀，此卦出现，官人逢之举步青云，心想事成，发达时往往比平常 快，且越级晋升。 商人逢之，为做生意当老板之人，财多禄丰，领导统御手段来 自天生好手，能当机立断，掌握时机，成就不可限量。 对于家庭，有强烈之责任感，为一良好丈夫，贤能的父亲，但 须切记，必须正名之人，即其正式负责人居之，乃可成此卦。如为 未婚人，不可能出现此卦。所以在阳宅之出现时机必在婚后，居此 位且坚心到底，必有大成就，例如总统也是由公务员做起，其特性 在其始终如一在此路上持之以恒，方可达到，今人常变工作，终日 忙于找寻适合自己的工作，結果必終身無成就。所以吾人在知曉此\n一真理之後，向求教之人說服其能居乾為天之卦位，則其心念必能成為一堅持到底之人，舉凡世上有成就之人，其一生絕不輕易離開其位，堅守原則，認清自己的實力，知道自己要追尋什麼，生命的意義，能一目了然，擺脫了財富名利之慾，人能無欲則剛，乃天經地義之事，加之深謀遠慮，知所進退，當必有所成。吾人之定位，其目的在讓人能明瞭知所進退，存亡之機，讀易不過如此，許多人知道且發表言論來提示人們如何拿捏的準，表示已瞭解到其重要性，但往往人性在聽時煞有其事的似乎瞭解了，可是事情一來卻什麼都忘了，有的人天生好手，在後天培養之下，乃能做到，但並非每一人都可如此，所以我們利用陽宅來定位，就如同電腦鎖定之後，其自然演生之過程，造成其為天生好手在事機之來時一舉一動，都很適時的令自己不逾越已份，知所進退，其成就必能過於常人。我常苦口婆心的勸人居定位，有時甚而疾聲厲呼的要求，希望他好，但改位的動作，卻不一定都會去做，只好看個人的福份了。總不能每一位上門求教的人，我都把易經八卦重講一遍，使其瞭解到其重要性，可改變一生，使明天更美好，對不對？\n\n【命理解析】乾为天䷀2022750\n先天卦：生带禄，智慧高，不见生父命为定数。\n后天卦：官带加身，名气大，四海扬名，财禄丰，父母全。\n流年卦:（男）连动三，好事多磨。六甲得子。（女）流年逢之，性过刚，婚事多磨总成空，真正丈夫在上位。\n\n\n【卦占卜故事】乾为天䷀此卦高祖与吕后走在芒砀山卜得之，余人难压\n也。\n\n【卦象图解】图中：鹿在云中，石上玉，有光明，人琢玉。月当空，官人登云梯，望月。\n六龙御天之课 广大包容之\n\n【卦图象解】一、官人在梯上：平步青云象。\n二、鹿在云中：作为行事心中不可求禄，则禄至矣。 \n三、石上玉有光明：示人才如玉之含光，吉也。 \n四、人磨玉：示人坚心不移，夕惕若厉，随时戒之。 \n五、工匠：有重立门户之象。(改门面，改朝换代) \n六、梯上官人：棺也。卜疾厄，凶也。 \n七、官人望磨玉人：示人即平步青云须戒盛，且望下看，念中无妄，则升迁平安，如争位 则旦夕而亡也。 \n（玉在石中，事未成需努力。人琢玉，要小心并坚心。月当空，局清明之象。）\n\n【卦义解读】三爻位是在下卦之最"
  },
  {
    "id": 2,
    "name": "坤为地",
    "hexagramSymbol": "䷁",
    "yaos": [
      "阴",
      "阴",
      "阴",
      "阴",
      "阴",
      "阴"
    ],
    "yaoci": [
      "初六：履霜，坚冰至。",
      "六二：直方大，不习，无不利。",
      "六三：含章可贞，或从王事，无成有终。",
      "六四：括囊，无咎，无誉。",
      "六五：黄裳，元吉。",
      "上六：龙战于野，其血玄黄。"
    ],
    "divinationDiagramName": "坤为地象解",
    "divinationDiagram": "十一箇口， 一官人，坐看二串钱。一官 人立受命，一马，金甲神人在台上乘云下，绶文书与官，土堆上有四点。\n生载万物之课 君倡臣和之",
    "explanation": "【卦象描述】坤为地䷁ 此格在阳宅上出现，就如易之言地厚能载物一样，已婚女人才 有，其包含寡居，且有子女同住，此局方现。 代表意义为婚姻主破散，孤军奋战，肩负一家之重任，夫宫不 得志造成此果，如以事业上论，则官家掌权，商人赚钱易如反掌， 女中强人型，其志过丈夫，无人能及，但缺点为到老孤单无子女愿 居身侧，因个性会趋于孤僻。 婚破后，不再有婚，何时婚破须看命，运只有占一半并非全 部。即令有对象出现，不过只能同居，而于婚姻，将不再有第二 次，这是肯定的。 此卦禁忌在其出现后，公司行号必须正妻之名，即女人当家方 有成就，很多人公司负责人为丈夫，惟干卦可行，但却居坤位，始成破格，终必败的。故如有一女人家，只要事业，只要健康，对于 婚姻因前次之失败，已无兴趣再婚者，此卦对其大利，终其一生成 就很大，财禄无缺，到老平安，必无夫之牵挂，此时男人对她来说 只是负担，终无所助。老来近于宗教，行善之人。\n\n【命理解析】坤为地䷁2013410\n先天卦：母仪天下为定数，厚德多才不重利，官带入命。\n后天卦：陈官人贪禄成灾，马人大吉受天命。忧心为财财不入，猴上逢之事竞成。生意人官司事非缠身。\n流年卦：女命逢之忌口舌，逢马相克事不成，破财因己不守。\n官人（司法）主贵，公职人员贪污犯官符。\n防窃。\n\n【卦占卜故事】坤为地䷁此卦汉高袓与项羽交争卜得之，乃知身霸天\n下。\n\n【卦象图解】图中：十一箇口， 一官人，坐看二串钱。一官 人立受命，一马，金甲神人在台上乘云下，绶文书与官，土堆上有四点。\n生载万物之课 君倡臣和之\n\n【卦图象解】一、十一口：吉也，陈姓人也。（众口烁金，替众人发言） \n二、一官人：倌人，丈夫也。公务员也。 \n三、坐看二串钱：欲拿不得，忧心忡忡状。 \n四、一马者：肖马人；指官贵；指调动也。 \n五、金甲神：（得）示民心也。 \n六、授文书与官：授官封侯。 \n七、土堆上有四点：黑也，背有阴谋也。\n（人空中来：民心，检举。堠（墙墩）：绶官封侯。）"
  },
  {
    "id": 3,
    "name": "水雷屯",
    "hexagramSymbol": "䷂",
    "yaos": [
      "阳",
      "阴",
      "阴",
      "阴",
      "阳",
      "阴"
    ],
    "yaoci": [
      "初九：盘桓，利居贞，利建侯。",
      "六二：屯如邅如，乘马班如，匪寇婚媾，女子贞不字，十年乃字。",
      "六三：即鹿无虞，惟入于林中，君子几，不如舍，往吝。",
      "六四：乘马班如，求婚媾，往吉，无不利。",
      "九五：屯其膏，小贞吉，大贞凶。",
      "上六：乘马班如，泣血涟如。"
    ],
    "divinationDiagramName": "水雷屯象解",
    "divinationDiagram": "人在望竿头立，车在泥中，犬头上回字，人射文书，刀在牛上，一合子。\n龙困浅水之课 万物如生之",
    "explanation": "【卦象描述】水雷屯䷂ 0532610此卦为次子卦，时机在长子未婚，且同居一处，方可论之，一 旦长子或本人结婚，此局立消，切记。 次子居此，则比长子早婚，比同时出生之人早二年结婚，但有 禁忌，如肖狗或狄姓之人，主夭折，此卦大凶，又逢犬年加凶，肖 牛人，必任妻摆布，背离家庭，不顾父母。所以如其他人成此局， 只不过早婚而已，对犬、牛人主凶，不利。屯卦有一運用，在家族事業，世代交替時，父必使次子繼位長\n子失寵，其運如此，吾人觀命時，必可發現，次子之事業必優於長子，才智能力超越長子多多，自然而然居此局，故吾人入宅如發現此局，反過來看，亦可得到很正確之結論，所以命運同參，方可瞭解同時生人之結果不同，即令同時生人都為次子，且長子屬肖也\n同，但卻不一定長兄生時皆亦同，差異即在此。\n次子越位，志過長兄局已定出，個性上亦同。\n｛倪注：住的位置不同，念不同，想法就不同。 次子居大子位，屯也，喜观察，有好事喜藏着不说，背道而驰。前提要同在一屋檐下，老大结婚，次需补位东宫，老大住乾位，老大把次子当大儿子一样的爱，这就是易经中的孝道。父亲做三儿子位为天山遁卦，为退隐之象。｝\n\n\n【命理解析】水雷屯䷂2110401\n先天卦：肖狗人父母双全，独子。\n肖牛人多血光灾，胆量过大麻烦多。\n外险内动，解：外动内险。\n后天卦：官运亨通发文职。（发内有弓）\n位高无权可平安，大器晚成。\n争名夺利必招凶，酉年须防父母凶。\n“字”象：浪子无家。（象书中的“字”字都为此解。）\n流年卦：事态不明阻力大。秋逢贵人发文书。强力求之必招灾，遇尼必主婚事破。\n女命逢之，夫调远方聚少散多，肖犬人主丧服。肖牛人顺道受阻。（解姓也为肖牛人）凡事多败贫且困。\n解：唯有读书为上吉，不做决策为上策。\n\n\n【卦占卜故事】水雷屯䷂0531740此卦季布遇难，卜得之汉推其忠，乃赦其罪。\n\n【卦象图解】图中：人在望竿头立，车在泥中，犬头上回字，人射文书，刀在牛上，一合子。\n龙困浅水之课 万物如生之\n\n【卦图象解】一、人在望竿头上立：此不明局势之屯难时也，不可妄动也。（倪注：要利建侯，广结善源） \n二、犬上回字：乃肖狗之人，狗年，狄姓之人，果为哭之象。 \n三、车在泥中：进退两难之象。刀在牛上：解也，牛为贵人象。 \n四、人射文书：张姓，小人阻碍也。射：同音，色也，绯闻（尔雅）。 \n五、牛不顺道：背道而驰，反其道而为之，吉。 \n六、人望：人亡也。 \n七、人立：（位也），在位也。 \n八、盒：先成后破。（倪注：用的是好碗，后容易摔破。相反衣服为先破后成也。） \n九、牛回头视犬：计无所出，待也。 \n卜得此卦：动于险中，先成后破也。\n｛倪注：范蠡生意经：人弃我捡，人争我於。｝"
  },
  {
    "id": 4,
    "name": "山水蒙",
    "hexagramSymbol": "䷃",
    "yaos": [
      "阴",
      "阳",
      "阴",
      "阴",
      "阴",
      "阳"
    ],
    "yaoci": [
      "初六：发蒙，利用刑人，用说桎梏，以往吝。",
      "九二：包蒙吉，纳妇吉，子克家。",
      "六三：勿用，取女见金夫，不有躬，无攸利。",
      "六四：困蒙，吝。",
      "六五：童蒙，吉。",
      "上九：击蒙，不利爲寇，利御寇。"
    ],
    "divinationDiagramName": "山水蒙象解",
    "divinationDiagram": "一鹿一堆钱，一合子，李树一枝子折，二人江中撑船，珍寳填塞。\n人藏禄宝之课 万物发生之",
    "explanation": "【卦象描述】山水蒙䷃ 阳宅上此局出现，必有三子居家中，且未婚，排行第三儿子，出此局其造成： \n一、以蒙蔽之法欺家人，惟利是图。\n二、本身愚昧，不知进退。 \n三、性刚不听兄长之言，独行独断。\n四、较次子早婚，较长子晚婚。 \n五、比同时生人早七年婚。 \n六、常喜赌博性之钱禄，故往往求财遇险之象。\n吾人入宅发现此局，当及早对其改局，惟有使他本人想通，方 可助他，否则即令父母耳提面命，亦于事无补，成败在一念之间 耳。 蒙之生，由已之念，俗言：二片叶子放在眼前，泰山也看不到 了。可见一念之差，距离有如此远，更遑论可能误一世，待后悔 后，已是百年身矣。抱持侥幸心理之人是最要不得的，你不会有第 二次机会再来过的，切记！切记！\n\n【命理解析】山水蒙䷃2111800\n先天卦：迷蒙不开，慧镜生尘。\n多病多灾。\n无子之家，有姐妹多，有子夭折。\n人于险中，主父母不合，父有凶。\n后天卦：蒙蔽世人总为财，得财遇险。\n先成后破，晚节不保。\n夫妻得财，却有子夭折。\n流年卦：李大吉，财禄亨通，（李：十八子）子夭折，发外戚得义子，财禄不正。官司逢之，招窃，先成后破，合伙凶。\n女命逢之，丈夫遇险，得财先成后破。合伙招凶。\n\n【卦占卜故事】山水蒙䷃此卦王莽篡汉社稷卜得知，乃知汉家必有中 与之主。\n\n【卦象图解】图中：一鹿一堆钱，一合子，李树一枝子折，二人江中撑船，珍寳填塞。\n人藏禄宝之课 万物发生之\n\n【卦图象解】蒙卦有示吾人去蒙之道。反观之，如人以蒙蔽之法示人，势必有所图也。｛倪注：关键在启蒙。外止内险为蒙。小孩子的蒙叫童蒙，童蒙好启成蒙不好启，成蒙要言简刚中且只说一次。双目似睁未睁，两眼无神，此为蠢、笨之象。去蒙之道，必待诚心至来求己，告之，方能去蒙，必以贞正。发民之蒙必以刑禁，立法为先。反过来，使人蒙必有所图私利。蒙致极，利用寇，当击伐之需适中，上下顺。｝\n图中： \n一、满船珍寳：暗示人图财之象。 \n二、船在水上：乃离国他去象。 \n三、鹿在地上，示仍有小禄于内，鹿—禄也。 \n四、两串钱：乃忧心忡忡象，即意虽有禄，但仍令人忧心。 \n五、图中一碗：示此蒙蔽手段，必先成后破，因其乃不正之财，必不久远也。 \n六、李树子折：示人李姓人氏，且有子夭折之象，则成格。"
  },
  {
    "id": 5,
    "name": "水天需",
    "hexagramSymbol": "䷄",
    "yaos": [
      "阳",
      "阳",
      "阳",
      "阴",
      "阳",
      "阴"
    ],
    "yaoci": [
      "初九：需于郊，利用恒，无咎。",
      "九二：需于沙，小有言，终吉。",
      "九三：需于泥，致寇至。",
      "六四：需于血，出自穴。",
      "九五：需于酒食，贞吉。",
      "上六：入于穴，有不速之客三人来，敬之终吉。"
    ],
    "divinationDiagramName": "水天需象解",
    "divinationDiagram": "月当天，一门，一人攀龙尾，一僧接引，一墓。\n云霭中天之课 密云不雨之",
    "explanation": "【卦象描述】水天需䷄0631740 此卦出现，代表其人智慧成长快速，势必超越同年纪同时生人 多多，且个性刚烈，不受建言，须注意，如长兄一旦结婚，此局立 消，局自长兄婚之日始，立变为雷天大壮收局。 \n需卦局所表现的意义如后：\n一、婚事延后七年，且单岁婚。\n二、如逢八字中，喜庆逢凶，必入宗教或不婚。 \n三、婚时，妻必为改嫁之人。 \n四、于事业上，必有大成，年少居权位，受重用，进退有据。\n｛倪注：所有的官司、纠纷等都是在正北方发生。古时正北方不住人，为祖先牌位。｝\n\n【命理解析】水天需䷄2112530\n先天卦：父先丧失，母独养成。攀龙附凤居于尾，五岁之前凶事。廿日大人入土中。\n后天卦：侍君身侧为驶席。（驾驶员）跟 随贵人终苦一身。兄弟争财，老来入空门。\n流年卦：有父凶之虑。草中有玉（天机），不见天日。尾大不掉，任人宰割。丢官（入空门可解，也可读书。）婚事有凶，易结难离。有侍犬（戌）年发福 发禄，（戌年，肖狗，犾姓，长得象狗）\n\n【卦占卜故事】水天需䷄此卦蔡顺遇赤眉贼，卜得知，乃知必脱大难\n也。\n\n【卦象图解】图中：月当天，一门，一人攀龙尾，一僧接引，一墓。\n云霭中天之课 密云不雨之\n\n【卦图象解】一、月当天：阴人居上位象，无担当也；清明无灾。 \n二、 一门：豪斗也，官府也。 \n三、一人攀龙尾：附于贵人，想进据其位也。 \n四、一僧接引：光头之人，柔而无欲之象。入空门可解。 \n五、墓：藏棺之地，有官与财象；置之死地而后生之象。 \n全意，即使如龙之力大，但动不以时，则有入墓之险，此动为求官 与财。佛理亦同：『生死一线，无死焉大生』。\n｛倪注：地上三寸的地方为天地之气交换之地，火灾时可趴在三寸处呼吸。｝\n\n【卦义解读】以二卦体而言，干以刚健，如上进而遇险，此未可进也。需待之。以卦之爻言，"
  },
  {
    "id": 6,
    "name": "天水讼",
    "hexagramSymbol": "䷅",
    "yaos": [
      "阴",
      "阳",
      "阴",
      "阳",
      "阳",
      "阳"
    ],
    "yaoci": [
      "初六：不永所事，小有言，终吉。",
      "九二：不克讼，归而逋，其邑人三百户，无眚。",
      "六三：食旧德，贞厉终吉。",
      "九四：不克讼，复即命，渝安贞，吉。",
      "九五：讼，元吉。",
      "上九：或锡之鞶带，终朝三褫之。"
    ],
    "divinationDiagramName": "天水讼象解",
    "divinationDiagram": "口舌二字，山下有睡虎，文书在云中，人立虎下，望口舌，柳树在旁。\n苍鹰逐兔之课 天水相违之",
    "explanation": "【卦象描述】天水讼䷅ 0633330此局令人官司不断，诉讼缠身，或为好讼之徒。一旦离婚此局 方破，否则你只好改变卧房位置，方可脱离此局之限。 \n一、官人居此局，升官慢五年，诸事不顺，即令不违法，亦受 他人连累。 \n二、商人居此局，财禄不进，必须兴讼方可得财。 \n三、夫妻婚姻主破，诉讼离婚，此须看命，如命中有，则必成 格；如命中没有，则不成格。 \n四、专业人士如医师，会计师等居此局，千万须防讼事来临， 流年逢之，同时生人没事，而你必生事端，运气不好使然。\n｛倪注：父居二子位，必讼。阳宅中，父第一位，母第二位，大儿子第三位，大女儿第四位，二儿子第五位，所以父居二儿子位降了五位。如果命中32岁掌权，需延后五年到37岁。｝\n\n【命理解析】天水讼䷅2113330\n先天卦：口舌是非，总是不断。祸因皆由口无摭。事与愿违，解：动则得咎。（勿动）\n后天卦：顺势而为，坚守正道方可平安。官运高不通，口舌缠身。有幸得财，险中求，一生不遂。王姓虎人为贵，从之吉。\n流年卦：口舌官司为他人，二次官司难免。肖虎贵人，王为凶人。处险随风平安（柳姓），柳姓刘姓为贵人。\n\n【卦占卜故事】天水讼䷅此卦汉高祖斩丁公，疑惑，卜得之后，果 遭戮也。\n\n【卦象图解】图中：口舌二字，山下有睡虎，文书在云中，人立虎下，望口舌，柳树在旁。\n苍鹰逐兔之课 天水相违之\n\n【卦图象解】0633000\n一、口舌二字：官司，纠纷，灾也。 \n二、山下有睡虎：入危地而不知象。 \n三、虎：王姓，肖虎之人。（或明正官人） \n四、文书在云中：心想事不成，幻想也。 \n五、人立虎下：近险也，近险为脱险之道。｛倪注：如厂中工人死，要主动积极处理，不要躲。｝ \n六、柳树：随风而动，虽大风而不断，此柳之性也。〔韩信之辱，即柳性〕 \n｛倪注：能曲能申为君子之性也，可以避讼。不官事情对错先认错再论理。｝\n\n【卦义解读】此因天上水下，二卦体相违，讼之由也。君子观象，知人有争讼之道，故行事必「慎始」， 絶讼端于事之始，则讼不生矣。 "
  },
  {
    "id": 7,
    "name": "地水师",
    "hexagramSymbol": "䷆",
    "yaos": [
      "阴",
      "阳",
      "阴",
      "阴",
      "阴",
      "阴"
    ],
    "yaoci": [
      "初六：师出以律，否臧凶。",
      "九二：在师中，吉，无咎，王三锡命。",
      "六三：师或舆尸，凶。",
      "六四：师左次，无咎。",
      "六五：田有禽，利执言，无咎。",
      "上六：大君有命，开国成家，小人勿用。"
    ],
    "divinationDiagramName": "地水师象解",
    "divinationDiagram": "虎马羊待命将军台上立，一文一武绶 印，人跪台上受印，棋盘在下。\n天马出群之课 以寡服众之",
    "explanation": "【卦象描述】地水师䷆0722600 此局大异其趣，吾人常见泼妇骂街，女人性刚，甚而与人殴 打，其局如此，生人如此，亦为妙矣。 当你发现母亲如此，凶暴，易与人起争端，仇视外人，其皆由 此局产生的，当须化解，方可平安。 \n一、对婚事必凶，有妻殴夫之象。 \n二、事业上，亦不得志，常生纠纷，男命女身。\n三、独来独往，胆大过人。 \n四、从商主破婚，得财，尤利虎、马、羊三人，其商机、官运 亨通，但婚则凶，各有利弊。 其与同时生之人或双胞胎大异其趣，各方面皆不同。\n｛倪注：母居正北房，二儿子位。正北位为行险之位，谁住都不好。｝\n\n【命理解析】地水师䷆2120250\n先天卦：神武于斯人，肖马肖虎肖羊人。恩宠九重天来，将星绶命主大贵。发武官人。（手足三人发二人）\n后天卦：平步表云，逢调必升。出将入相棋子少，难一缺失。\n流年卦：升相之年，回阳回首虎为后。命印中央，绶封年。（倪注:台，室人做喜）\n\n【卦占卜故事】地水师䷆此卦周亚夫将欲排阵，卜得之，果获胜。\n\n【卦象图解】图中：虎马羊待命将军台上立，一文一武绶 印，人跪台上受印，棋盘在下。\n天马出群之课 以寡服众之\n\n【卦图象解】一、肖虎、马、羊之人三合：可战。\n二、文武二官绶印：得万人服之帅。 \n三、人立棋盘上：围棋愈下愈多，但须有谋略方可成事。（象棋越下越少。） \n四、将军台上立：示有兵权也。生杀之专权也。武职大利。 \n五、羊回首：回阳也，病危之人卜之，有自阴间回阳间之象。 \n六、虎在马后：为马之靠山，马因虎威而动。故马回首视虎。"
  },
  {
    "id": 8,
    "name": "水地比",
    "hexagramSymbol": "䷇",
    "yaos": [
      "阴",
      "阴",
      "阴",
      "阴",
      "阳",
      "阴"
    ],
    "yaoci": [
      "初六：有孚，比之无咎。",
      "六二：比之自内，贞吉。",
      "六三：比之匪人。",
      "六四：外比之，贞吉。",
      "九五：显比，王用三驱，失前禽，邑人不诫，吉。",
      "上六：比之无首，凶。"
    ],
    "divinationDiagramName": "水地比象解",
    "divinationDiagram": "月圆当空，秀才望月饮酒，自酌自斟，药炉在高处，枯树开花。\n众星拱比之课 水行地上之",
    "explanation": "【卦象描述】水地比䷇ 0730850此卦出现，须长兄为未婚，一旦长兄婚，此局立变为豫卦，须 注意变局将如何，则看长兄之命，何时有婚，知何时生变局，此即 阳宅上可见未来之象。 此卦有亲比之意。 \n一、性喜从母事，且任劳任怨，家事一手包办，与母连心。 \n二、适婚年龄到时，喜欢比自己年长于己之女人，如命中同时 生人为二十八岁婚，但此局人婚必延后三年到三十一岁才婚，且娶 年长于己之女人方合格，否则婚主破散，不出一年。 \n三、如命中主破，婚事不成，再居此局，则终身不娶，且与有 婚或离婚之女有来往，终无果也。 \n四、事业上则居佐才之位，无法任职主管。 \n五、商场上亦为人工作，不为老板，同时生人有可能为很成功 的老板，但命只居三才之三分之一，运的局影响，使其终身不得 志，且与同时生人有不同之结果。 唯俟长子成婚后，局方可改变，如长兄居侧，或认干兄，此局势必难变。\n｛倪注：次子居母位。命属偏房男子终身不娶0731140。如果儿子不听话让其住西南角，坤卦位变妈妈，具母性。｝\n\n【命理解析】水地比䷇2120940\n先天卦：母为贵命中定数。歌舞升华，才出众。孤独一身谁来问，（倪注：如伶人，面象：鼻棱直，鼻尖尖）父不全，晚得子。三星相佐，内通外流（天机道）\n后天卦：妻宫得力，险为 贵人。四五之后方兴发，有病无灾清闲人，有志不遂晚来子贵。\n流年卦：母吉父无助，才艺之人无事做，教职吉此为顶点，桃李满天下。\n\n【卦占卜故事】水地比䷇此卦陆贾将说蛮，卜得之，果胜蛮王归也。\n\n【卦象图解】图中：月圆当空，秀才望月饮酒，自酌自斟，药炉在高处，枯树开花。\n众星拱比之课 水行地上之\n\n【卦图象解】0730410\n一、月圆当空：政治清明象。 \n二、三星拱照：得贤能刚直之人辅助。 \n三、秀才望月饮酒：示才智之人无忧也。(亦示：作秀之人，于政治清明时，无法出头〕 \n四、自酌自斟：无欲则刚象，孤独之象。 \n五、药炉在高处：无病无灾，故不需用药也。 \n六、枯树开花：晚发也（面相：耳珠朝（翘）嘴）。示心有诚（亦示有坚心），制度立，事必成。\n七、酒：忘忧之物。 \n全卦：上位清明，三台辅佐，人将无忧，即使枯树亦能开花。\n｛倪注：面相：耳朵轮廓分明，比脸白，正看不见耳，大富。｝\n\n【卦义解读】相比之道，须两志相求，如互不相求则为睽卦，故战国策〈中山策〕有同欲相憎，同忧相 亲之理。所以好的制度，能使人有所依从，故能互相亲和也。 彖曰：比，吉也。比，辅也，下顺从也。 因相亲比为吉之道，有相辅相成之意。但求比之道，须如臣下顺从君"
  },
  {
    "id": 9,
    "name": "风天小畜",
    "hexagramSymbol": "䷈",
    "yaos": [
      "阳",
      "阳",
      "阳",
      "阴",
      "阳",
      "阳"
    ],
    "yaoci": [
      "初九：复自道，何其咎，吉。",
      "九二：牵复，吉。",
      "九三：舆说辐，夫妻反目。",
      "六四：有孚，血去惕出，无咎。",
      "九五：有孚挛如，富以其邻。",
      "上九：既雨既处，尚德载，妇贞厉。"
    ],
    "divinationDiagramName": "风天小畜象解",
    "divinationDiagram": "两重山，一人在山顶，舟横岸上，望 竿在草中，羊马过河。 竿在草中，羊马过河。\n匣藏宝剑之课 密云不雨之",
    "explanation": "【卦象描述】风天小畜䷈ 0733010此卦局，着重于事业，不重于婚姻，凡家有女儿皆易成此局， 卦局之判读，请参阅录像教学带，此处不言。 \n一、女代父职，且能力强过男人，独立自主，不依赖他人。 \n二、事业企图心旺盛，早年为老板，事业有成。 \n三、婚事方面，须与命同参，如同时生人为二十八岁婚，而此 阳宅局之人会提前二年结婚。如同时生人婚姻不成主有婚必破，此 局之人必终身不嫁，全心在事业上发展，成为一女强人。 此局大利肖羊、马之人，但即令有婚，夫亦无力助之，全靠一 己之力独撑大局。\n｛倪注：长女居西北位，具父性。到老现家。名与位的详解0740001：名=位，家和（一家人各安其位，各自住自己的房间、方位）。位=名，事业兴（要事业顺必须用该房间位的人姓名登记挂名做事业。）。在临床上看，家中的卧房哪个大发哪位，那位的人头脑最清晰，权利最大。｝\n\n【命理解析】风天小畜䷈2121700\n两重山阻，外所发迹。舟扬犹待水来会。（周，杨，羊）草头人生，马领羊过险。山顶独行，特立人间。\n后天卦：外乡发迹，命中贵。万事具备，东风为水。（水为，年，人，事等）两地相隔，夫妻反目。马羊之人，独子不亡，（天机道）\n流年卦：孤立无援，前险后阻。左支右绌，草头人出力大（黄，苗等）。逢马羊可脱困，二次努力可得。婚事 逢之分两地，草头人望归。\n\n【卦占卜故事】风天小畜䷈此卦韩信击取散关不破，卜得之后，再撃之 果破也。\n\n【卦象图解】图中：两重山，一人在山顶，舟横岸上，望 竿在草中，羊马过河。 竿在草中，羊马过河。\n匣藏宝剑之课 密云不雨之\n\n【卦图象解】0732130\n一、两重山：知有险阻于前，不妄动之象。亦为“出”字象。 \n二、一人山顶：孤立独行象。已至颠峰，将走下坡之意。 \n三、舟横岸上：准备出发，水未至而不行也。 \n四、望竿在草里：等待讯息象。草头姓人（黄姓）为贵人。望，亡也。 \n五、上有羊马：马引羊过河，马为贵人，肖马人，姓马人也，马亦为午时。 \n全卦：一人在顶颠，但有疑，前有二山所阻，只有等待消息，午年 或午月、午日、午时或马人引羊至，不由水路而来也。\n｛倪注：卜到凶卦，看当事人面相：左日父右月母，眼袋左子右女，眼角夫妻，如果没有灾色可能当事人有坏心。｝\n\n【卦义解读】小畜之卦，因第"
  },
  {
    "id": 10,
    "name": "天泽履",
    "hexagramSymbol": "䷉",
    "yaos": [
      "阳",
      "阳",
      "阴",
      "阳",
      "阳",
      "阳"
    ],
    "yaoci": [
      "初九：素履往，无咎。",
      "九二：履道坦坦，幽人贞吉。",
      "六三：眇能视，跛能履，履虎尾，咥人凶，武人爲于大君。",
      "九四：履虎尾，愬愬愬愬愬愬愬愬终吉。",
      "九五：夬夬夬夬履贞厉。",
      "上九：视履考祥，其旋元吉。"
    ],
    "divinationDiagramName": "天泽履象解",
    "divinationDiagram": "笠子下一女， 文书破，手中有伞，军旗 官人边坐，堠上有千里字，地上两点足印。\n如履虎尾之课 安中防危之",
    "explanation": "【卦象描述】天泽履䷉ 女人无履，唯男人有之，此局可见男女之本性不同，女人外似 柔弱但一遇进退两难之时，却往往比男人果决，男人外似刚强，但 遇险事却往往踯躅不前，成履卦。 \n一、事业上常有欲进不得，退之又凶，居进退两难之局，其事 势如此，而其性亦如此，其解常靠女人决定之。 \n二、官运不通，停滞不前。 \n三、商机不利，运气不佳，取舍之间，因时机已误，丧失良好 机会，徒于事懊恼而已，于事无补。婚事方面，妻能力过于己，故有在外娶妾之行为，以求恢 复男人之自信心、自尊心，故于婚姻主凶。同时生人如命中婚姻不 散则感情破裂，终而同床异梦，但如命中，主婚姻破裂，再加运上 此局，则必主破散无救。此同时生人之不同处，流年不同之因也。\n｛倪注：父亲住三女位，为正西方 。｝\n\n【命理解析】天泽履䷉2211730\n先天卦：庶出之人天注定。寄人旗下不自知。早年离家，重重阻隔。科甲不兴，桃花多。\n后天卦：妾有闪，人偏离，近军令（如当兵，法院传票）。重楼之侧无名有险。夫妻相隔总为情。官司失财生横事。\n流年卦：男外有妾，重楼之内。武官外调，财不利。契约成空婚事凶。竹子立上文书破。遇猴乃有千里行。（倪注：天机道，里——日出地上，灾从内生。断明之能：继承上代好的东西传承下去。）\n\n【卦占卜故事】天泽履䷉此卦子路出行，卜得之，遇虎拔其尾也。\n\n【卦象图解】图中：笠子下一女， 文书破，手中有伞，军旗 官人边坐，堠上有千里字，地上两点足印。\n如履虎尾之课 安中防危之\n\n【卦图象解】0823100\n一、女人在笠下：妾也。 \n二、千里堠：远离外出封侯象。 \n三、文书破在地：凭证承诺无效象。 \n四、伞下：有庇荫也。 \n五、军旗下官人坐：主有官司、诉讼、牢狱之灾象。 \n六、二点在地：践踏之足印也，示人处危之时，有礼之道，乃能行危而无殃也。"
  },
  {
    "id": 11,
    "name": "地天泰",
    "hexagramSymbol": "䷊",
    "yaos": [
      "阳",
      "阳",
      "阳",
      "阴",
      "阴",
      "阴"
    ],
    "yaoci": [
      "初九：拔茅茹，以其汇，征吉。",
      "九二：包荒，用冯河，不遐遗，朋亡，得尚于中行。",
      "九三：无平不陂，无往不复，艰贞无咎，勿恤其孚，于食有福。",
      "六四：翩翩不富，以其邻，不戒以孚。",
      "六五：帝乙归妹，以祉元吉。",
      "上六：城复于隍，勿用师，自邑告命，贞吝。"
    ],
    "divinationDiagramName": "地天泰象解",
    "divinationDiagram": "月中桂开，官人登梯，鹿衔书，小儿 在云中，羊回头，地下乱点。在云中，羊回头，地下乱点。\n天地交泰之课 小往大来之",
    "explanation": "【卦象描述】地天泰䷊ 0832700此名为泰卦，有否极泰来，安泰舒适之象。每逢有已婚女向本 人求教之时，我都以此卦教之，令改，促进夫妻和睦乃吾道中人之 一大职责，此功德无量。 此局大吉，无论于婚姻、事业、健康及教育子女上，都有卓越 之表现，为一贤妻良母。 \n一、于婚姻，主一世夫妻，白首到老。 \n二、于事业，在家相夫教子亦为事业。在公事上，进退有据， 受人重用，必不待言，其心想事成。 \n三、于健康主平安到老，一生无大病痛，凡未经指点，能得此 局之人，必属大富大贵之人，福厚之人，一生无灾，常见命格好之 人，自然居之，真所谓「福地福人居」实不为过。实务上，吾人可 见命薄之人，不但无法居此，即使你告诉她有如此好，而她亦会因 外在环境上之束缚，而无法改变自己，不知人与天争，即在此，祸 福在一念之间耳。唯自求多福，但希望你真能自求而生多福，但须 知世事常不尽人意，如能刻意成局之人乃属有福之人，其刚柔动静之间，必能掌握机先，事事快人一步，终必大成。\n｛倪注：妻住夫位或与夫同住西北角，此治世之道也。新婚第一天夫妻住西北角最好且夫妻两人同住最好，此为阴阳调和。长幼有序，各得其位，各得其名。正名：当公司注册法人时，需注册宫位上的人名，如太太和先生在西北角乾卦上住，需挂先生名字不能挂太太名字，但如果太太西南角有宫或住在西南角可挂太太名字。｝\n\n【命理解析】地天泰䷊2212540\n先天卦：父登青云位，生在清贵家。禄命来，少年得志。遇羊回阳。羊杨有桂（桂：桂丹，指接到很高的命令）。中年以后禄命至九重来。\n后天卦：桃李满天下，清誉贵人家。官人受禄命，平登青云志。有子在远方，逢羊杨方回，子大贵。\n流年卦：官运亨通。疾厄回阳。禄财丰盛，进二春吉（春天时会进二）。男带桃花，婚事必成。\n\n【卦占卜故事】地天泰䷊此卦尧帝将襌位，卜得之，乃得舜而逊位。\n\n【卦象图解】图中：月中桂开，官人登梯，鹿衔书，小儿 在云中，羊回头，地下乱点。在云中，羊回头，地下乱点。\n天地交泰之课 小往大来之\n\n【卦图象解】0832320\n一、月中桂开：清明政治之时。 \n二、官人登梯：升迁顺遂之意，官人亦倌人，即丈夫也。（这里不是棺，因为下有羊回头为回阳。） \n三、鹿衔书：受天子恩赐禄位。 \n四、小儿在云中：少年得志象。得天官贵人助也。（亦示倪姓。） \n五、羊回头：回阳间也。亦杨姓人，发肖羊人成格。"
  },
  {
    "id": 12,
    "name": "天地否",
    "hexagramSymbol": "䷋",
    "yaos": [
      "阴",
      "阴",
      "阴",
      "阳",
      "阳",
      "阳"
    ],
    "yaoci": [
      "初六：拔茅如，以其汇，贞吉，亨。",
      "六二：包承，小人吉，大人否，亨。",
      "六三：包羞。",
      "九四：有命，无咎，畴离祉。",
      "九五：休否，大人吉，其亡，其亡，繋于苞桑。",
      "上九：倾否，先否后喜。"
    ],
    "divinationDiagramName": "天地否象解",
    "divinationDiagram": "男人卧病，镜破， 人路上坐，张弓箭 头落地，人拍掌笑，口舌。\n天地不交之课 人口不实之",
    "explanation": "【卦象描述】天地否䷋ 0930920惟男人有之，此男女本性之不同，亦可于此卦局窥见之，男人 之性过刚于女，自尊好强之心，又显现无遗，往往天性上，有欲大 力小之性而不自知，不知己之才能如何，妄度不知量进，乃终成否 卦。 常见个性如此之人居否局，而不自知，仍自以为是，故终其一 生必无成就，每日只知怨天尤人，叹时不利己，己不逢时而已。 \n一、于婚事主大凶，夫妻反目成仇，加上命格中如婚破，又在 运宅上居此局，则势必无法挽回。 \n二、官家之人，必主否塞不通，终致无成，不但不升官，反招 凶祸，乃致退休。 \n三、商家人，居此局，必生大耗，财耗家散，终致一败涂地。 \n四、健康上亦凶，主大病缠身，如加上命中流年逢羊刃，血光 必现，在数中难逃此大限之局。\n｛倪注：先生住太太之坤位，西南角。妻盛夫衰，升迁不成，诸事不顺。履可解否，履者，礼也。如果命中有二婚，天命+地理>人间道，必离婚。｝\n\n【命理解析】天地否䷋2213110\n先天卦：中年前运阻挠。少年家运财禄破。父母相刑不往来。长弓发而未中（长弓为张姓）。落第不须叹。明中有损。不入衙门，卖卜人。\n后天卦：财破人佯病，连续口舌来。不从生意人，内中心虑无人知。机内诬陷总不成，唯有青灯伴到老（出家）。\n流年卦：主人官司，暗害口舌。财破折伙，婚姻破裂。长弓竟金不中且破财。防人暗害，勿听谣言。二戈一贝，自寻烦恼。寸言至身逢张落地。\n（倪注：掌，堂上拿人也）\n\n【卦占卜故事】天地否䷋此卦苏秦将游说六国，卜得之，果为相矣。\n\n【卦象图解】图中：男人卧病，镜破， 人路上坐，张弓箭 头落地，人拍掌笑，口舌。\n天地不交之课 人口不实之\n\n【卦图象解】0923130\n一、男子卧病：男子为阳，阳同佯，装病之象也。（倪注：当政局不明，小人得道之否时，可佯病退守以待时机。） \n二、镜破：（招），不可赴也。（夫妻）破镜难圆之象。（金字与竞字为争，争利也，凶。争利之要诀古训：背道面驰，人弃这捡，人争我予。） \n三、人路上坐：小人阻路，不让进也。（倪注：小人一般为一群，最怕刚直之人，所以阻之。） \n四、张弓箭头落地：鸟尽弓藏也。 \n五、人拍掌笑：幸灾乐祸之小人，做假攻讦两人感情得逞状，夫妻凶。 （倪注：此种人之面相：未言先笑或低头不敢直视人。）\n六、舌：主口舌，官司，謡言生害。 \n七、口上有四点：四点为黑，暗中诬陷之謡言，古人谓三口成虎，即意此。 （倪注：谣言止于智者。要做听明之人：有害时，当一个傍系亲属说出超出他专业（不懂之专业）的话，做出比平时数倍的关心状，最毒为此人。面相：男眉直对人，女眉上发青，此为犯桃花。讲人是非之人和听人是非入耳当真之人都是小人。不要做人（当好人说道），只做事（对的就去做）。）\n\n【卦义解读】否卦之"
  },
  {
    "id": 13,
    "name": "天火同人",
    "hexagramSymbol": "䷌",
    "yaos": [
      "阳",
      "阴",
      "阳",
      "阳",
      "阳",
      "阳"
    ],
    "yaoci": [
      "初九：同人于门，无咎。",
      "六二：同人于宗，吝！宗为宗党也，同于所派系，此有所偏，故可吝。",
      "九三：伏戎于莽，升其高陵，三岁不兴。",
      "九四：乘其墉，弗克攻，吉。",
      "九五：同人，先号咷而后笑，大师克相遇。",
      "上九：同人于郊，无悔。"
    ],
    "divinationDiagramName": "天火同人象解",
    "divinationDiagram": "人捧文书上有心字，人张弓，射山上，一鹿饮水，一溪。\n游鱼从水之课 二人分金之",
    "explanation": "【卦象描述】天火同人䷌ 0933000此局在阳宅上亦妙不可言，学者切勿分辨错误，须仔细分详， 以免误人而不自知。 \n一、官家人逢之，必主人和，手下得力，禄命九重来，平步青 云。\n二、商人逢之，财禄丰盛，但须二人合伙，方可成事，一人独 资势必不成大器。 \n三、自由业、服务业居此局，必主名气大，声名远播，财禄亨 通。 \n四、对妻不利，因此局出现，妻必成明夷卦，主妻有暗伤，血 光难逃，故不如干为天，地天泰吉，即在此，不利妻之处。 吾人常见夫妻一对，夫之事业如日中天，而妻子却病灾不断必 为此局之阳宅也。\n｛倪注：父亲住二女位，正南方。已婚男唯一发科甲之卦。再看八字化科、文昌、文曲、天魁、天钺科甲星之位，睡觉脚的朝向调位其诸科甲星方位上，用罗金定位才有用，看罗盘没用，需上三个月以前入住，妻子不要入住。天火同人和地天泰主文、武官升迁，在企业主财禄丰盛。如果是夫妻同住正南方，妻为地火明夷卦主暗伤（妇科疾病或受小人背地言语中伤）。如果此人命里发科甲自身又努力，地理位置对他没有影响，照样考试高中，所以我们算命时要天、地、人三才同时考虑。｝\n\n【命理解析】天火同人䷌2220310\n先天卦：生时带财人称羡。文武双全受封诰。名登金榜长弓宁。第三儿成格，余减半。\n后天卦：文从武，武从文。名利双收，心想事成。发于黄甲（黄袍等）。数中四子，三子送终。\n流年卦：金榜登科。一朝扬名，四海同心。专心坚持，到终必成。冬加一喜。\n\n【卦占卜故事】天火同人䷌此卦刘文龙在外求官，卜得之，果衣锦还乡。\n\n【卦象图解】图中：人捧文书上有心字，人张弓，射山上，一鹿饮水，一溪。\n游鱼从水之课 二人分金之\n\n【卦图象解】0932650\n一、人捧文书上有心字：得民心之象，同心协力之象。宁姓（繁体宁字中间有一心字）。 \n二、人张弓射山上：高中金榜。张姓人氏。 \n三、一鹿饮水：财禄滚滚而来。亦在野之贤人（倪注：鹿之性：动则敏，静则顺。贤人有鹿之性也）。 \n四、一溪：平和安静状。 \n五、鹿之性，动则敏，静则顺，此刚健人之性，世间但闻虎食人，未闻鹿食人。\n\n【卦义解读】下体为有文明之德，上卦为刚健之性，此君子之正道。天下之志万殊且异，但理则一也。 君子因明理，故能通天下之志。圣人视亿万人之心为一心，因只一理而已。文明能使人更明理， 故能明大同之真义，刚健必能克已，则必能致大同之道。象曰：天与火，同人，君子以类族辨物。 天在"
  },
  {
    "id": 14,
    "name": "火天大有",
    "hexagramSymbol": "䷍",
    "yaos": [
      "阳",
      "阳",
      "阳",
      "阳",
      "阴",
      "阳"
    ],
    "yaoci": [
      "初九：无交害，匪咎，艰则无咎。",
      "九二：大车以载，有攸往，无咎。",
      "九三：公用亨于天子，小人弗克。",
      "九四：匪其彭，无咎。",
      "六五：厥孚交如，威如，吉。",
      "上九：自天祐之，吉，无不利。"
    ],
    "divinationDiagramName": "火天大有象解",
    "divinationDiagram": "妇人腹中一道气，气中二小儿，一药 王，药有光，女人受药，一犬。\n金玉满堂之课 日丽中天之",
    "explanation": "【卦象描述】火天大有䷍ 1030100吾人常见有未婚之女，娇美如花，事业上功成名就，但婚姻不好，即此局之人。 \n一、性阳刚过人，倔强固执本性展现无遗。（女人主事。） \n二、不重视婚姻，也不在乎婚姻，唯对子女独有所钟，有未婚生子之象，且不在乎人言，且主得二子。 \n三、如遇命中婚姻顺畅，则比同时生人要早三年成婚。 \n四、命中事业旺，祖业大之人，再加上此局，势必为女承父业 之象，兄弟无力。 肖犬之小姐居此局反之，必主大吉大利，智慧高，婚事吉，事 业顺利，婚后有二子双生之象。\n｛倪注：次女住父位，西北角也。据洛书九宫八卦，次女离卦为9，父乾卦为6，离居乾位进3，所以婚事提前3年。如果命为36岁结婚，提前到33岁结婚。｝\n\n【命理解析】火天大有䷍2220840（倪注：六神占很好。）\n先天卦：数中兄弟二人，谋略过人，人生即富。狗人逢之必加吉。男招贵妻，女招贵夫。名狄肖犬是 真形。\n后天卦（很好）：医星高照，悬壶得名。药济众生，双人一儿，犬在侧。诸事顺遂，当得半子。良马逢伯乐，宝玉有光彩。\n流年卦：医星入命，声名远播。有喜且双喜，生子，又逢犬年更加吉。问鼎天下。（可找犬入象）\n\n【卦占卜故事】火天大有䷍此卦蔺相如送赵壁往秦，卜得之，果还壁归 赵也。\n\n【卦象图解】图中：妇人腹中一道气，气中二小儿，一药 王，药有光，女人受药，一犬。\n金玉满堂之课 日丽中天之\n\n【卦图象解】1023130\n一、妇人腹中一道气：妊娠主事；事萌于内也。 \n二、气中二子：主双喜临斗。伯仲之间象（两个相似）。 \n三、一药王：平安之象。得病有救，遇良医也。 \n四、药有光：药有名也，灾中有救也。 \n五、女人受药：女人为阴，示表面不信，但暗中仍听之。 \n六、一犬：乃狗年，戌月，戌日，此论时机也；或狄姓人士。 \n七、犬：哭笑皆有象。（因哭笑之下皆有一大字。）\n\n【卦义解读】此乃以卦才而言，不言元亨利贞四德，乃恐与乾坤二卦相混淆，只言元亨乃尽元之义，元 乃物之始，万物生成之"
  },
  {
    "id": 15,
    "name": "地山谦",
    "hexagramSymbol": "䷎",
    "yaos": [
      "阴",
      "阴",
      "阳",
      "阴",
      "阴",
      "阴"
    ],
    "yaoci": [
      "初六：谦谦君子，用涉大川，吉。",
      "六三：呜谦，贞吉。",
      "九三：劳谦，君子有终，吉。",
      "六四：无不利，撝谦。",
      "六五：不富以其邻，利用侵伐，无不利。",
      "上六：鸣谦，利用行师，征邑国。"
    ],
    "divinationDiagramName": "地山谦象解",
    "divinationDiagram": "月当天，一人骑鹿，三人脚下乱丝，贵人捧镜，文字上有公字。\n地中有山之课 仰高就下之",
    "explanation": "【卦象描述】地山谦䷎1032430 谦卦九三爻位，劳谦，君子有终，有劳谦之美。史上如周公， 为其代表。常见妇人，任劳任怨，居无所苦，谦以让人，妇之贤 德，表现无遗，且始终不变，即此卦局能成。 \n一、必为贤妻良母之人无疑，但夫卦为遯，主夫妻不利，感情 退化，所以常见有贤德之妇人，往往尽心尽力为家操心，结果却无法挽回婚姻之善（因有性冷感），但六十五岁以后不成此局。 \n二、身体小病痛不断，因劳成疾多有。 \n三、官家人逢之，主遇事公平处之，一丝不茍之人。 \n四、商家人得此局，必生财禄，但往往有股东不合，因分利不 均而破坏。 \n五、同时生人，则有官带现，如命为公职人，但居谦卦局，有 民选官之倾向，商家人亦有此倾向，会居国会殿堂之中。\n｛倪注：母居东北位。有性冷感。外饰清明，内实小人。看似谦实非谦（除非女人满腹经纶）。所思不成，头痛（因所想所要不能得）。久居目现凶光。母身体要好最好住西南角，坤卦位。夫妻要好最好住西北角，乾卦位。东北角父住比较好，所以65岁以后的夫妻分房睡较好。年青气盛之时，夫妻睡一起可阴阳调和，年老力衰后需养精蓄锐方可长命百岁。｝\n\n【命理解析】地山谦䷎2221430\n先天卦：智明如月，才德兼备。众人心乱，无所适从。谦受益，满招损。出则凶，受世人诬陷，潜藏吉，看尽人间百态。\n后天卦：君子临朝，小人退后。为官公正，贤人入朝。逢马最奇，禄且明。\n流年卦:勾陈有窃，三人成行。贵人为官，明月当天。有禄至，不守。事后官司，终有巢。\n\n【卦占卜故事】地山谦䷎此卦唐玄宗因禄山之乱，卜得之，乃知干 戈必息也。\n\n【卦象图解】图中：月当天，一人骑鹿，三人脚下乱丝，贵人捧镜，文字上有公字。\n地中有山之课 仰高就下之\n\n【卦图象解】1031940\n一、月当天：清明之政，中秋时也。 \n二、一人骑鹿：才禄俱备。 \n三、三人脚下乱丝，隐于山后：小人不敢正面示人，惟隐山谦之后(即外饰谦为幌子)实则乱如麻，计无所出（因为清明之政将要来到）。\n四、贵人捧镜：明镜高悬，执法公正光大。 \n五、文字上有公字：处事以公，得理也。 \n全卦：不知谦下自晦，果必招讼也。\n｛倪注：得谦之道，为有理走遍天下。谦不可太过，小心易盛。用谦之道，为柔中带刚。｝"
  },
  {
    "id": 16,
    "name": "雷地豫",
    "hexagramSymbol": "䷏",
    "yaos": [
      "阴",
      "阴",
      "阴",
      "阳",
      "阴",
      "阴"
    ],
    "yaoci": [
      "初六：鸣豫，凶。",
      "六二：介于石，不终日，贞吉。",
      "六三：盱豫，悔。",
      "九四：由豫，大有得，勿疑，朋盍簪。",
      "六五：贞疾，恒不死。",
      "上六：冥豫，成有渝，无咎。"
    ],
    "divinationDiagramName": "雷地豫象解",
    "divinationDiagram": "两重山，一官人，一禄一马，金银数 锭，钱一堆者。\n凤凰生雏之课 万物发生之",
    "explanation": "【卦象描述】雷地豫䷏ 1040630成此卦局之男人，必有因禄远行之象，大利肖马之人。 \n一、居家中为母助，家事琐碎，巨细靡遗，有男人能做一手好 菜即此局之人。 \n二、事业财官双美平步青云，惟与六亲远离，母有先丧之象。 \n三、婚姻延后，此同时出生之人晚五年婚。｛倪注：晚一年。｝\n四、事业上为良佐之人，任何老板或主管任用之后，都将得幸有此人相助。 \n五、婚事有娶二婚妻之象，或年长于己之小姐。\n｛倪注:长子居母位，西南角也。一、有母性悦于家事。二、娶二婚之妻或年长之妻。三、代母位，有缺母之象。四、婚晚。五、事业为佐才。｝\n\n【命理解析】雷地豫䷏2221930\n先天卦：内忧外阻，父有凶。禄马交驰入豪门。马人大利，凶为吉(看起凶，实则为吉)。不为官人为富商。五阴一阳数中定。孤子承母，三千宠爱在一身。\n后天卦：生意兴隆财禄多。出山得金又得官。\n流年卦：冬有丧服，为阴人。出得外地分东西。草原千里为险阻，动得干戈有官司（草原千里为董姓）。（天机道）解：去官从商南北走。\n \n\n【卦占卜故事】雷地豫䷏此卦诸葛孔明讨南蛮，卜得之，便知必胜。\n\n【卦象图解】图中：两重山，一官人，一禄一马，金银数 锭，钱一堆者。\n凤凰生雏之课 万物发生之\n\n【卦图象解】1040230\n一、两重山：出象，千里阻隔也（倪注：亦示外调）。 \n二、官人在中：外出不任官象；（官人亦作倌人即丈夫也）丈夫外出从商。 \n三、一禄一马：从商之人，财禄丰盛。 \n四、金银数锭：（放地上为）纸钱锭，主丧服。 \n五、钱一堆者：内有忧心忡忡象。 \n 全卦：此卦内有忧，外有阻，乃顺势而动，禄马来会，可去官从商矣。 \n｛倪注：鸭步为大富。｝\n\n【卦义解读】豫之时义大矣哉。圣人知豫而体用豫之道，故于时机之掌握大矣，此卦之下有十一卦，豫、遯、姤、旅，皆 言时之义。坎、睽、蹇，皆言时之用。颐、大过、解、革，皆言时之大也。 象曰：雷出地奋，豫。先王以作乐崇德，殷荐之"
  },
  {
    "id": 17,
    "name": "泽雷随",
    "hexagramSymbol": "䷐",
    "yaos": [
      "阳",
      "阴",
      "阴",
      "阳",
      "阳",
      "阴"
    ],
    "yaoci": [
      "初九：官有渝，贞吉，出门交有功。",
      "六二：系小子，失丈夫。",
      "六三：系丈夫，失小子，随有求得，利居贞。",
      "九四：随有获，贞凶，有孚在道以明，何咎？因四位乃臣之极位，如随而有获，即正亦易招凶，皆因天下之心随于己。",
      "九五：孚于嘉，吉。",
      "上六：拘系之，乃从维之，王用亨于西山。"
    ],
    "divinationDiagramName": "泽雷随象解",
    "divinationDiagram": "云中雁传书，一堆钱，朱门内有人坐一人在门外立，地上一堆珠。\n良士琢玉之课 如水推车之",
    "explanation": "【卦象描述】泽雷随䷐ 此卦现代人最多见，吾人常见街上有女孩，女扮男装或粗壮过 一般女人之小姐，即此局之人。 \n一、有女同性恋之倾向，其心念一直认为自己为男人，且不屑 自己为男人，且不屑一顾周围之男人，喜与女孩同出同入。 \n二、全心于事业，为达目的不择手段，有时位高且居天子或董 事长之身侧。 \n三、如同时生人，命中婚姻吉祥，再加此局势必嫁入富贵人 家，且比同时生人，早婚四年，如对方不富有，终必散。 故学者如此，必须天文地理合局，方可确知同时生人之不同在 何处，同时亦知如何可解。比方遇此卦局之人，命中婚姻又凶，吾 人事先探知，利用巽为风卦，即可解开此局生成之祸端。\n\n【命理解析】泽雷随䷐2222350\n先天卦：云中雁来向南行。顺性顺命人随和。身在豪门不重利。遇事避开，无有担当（面象：溜肩之人）。男女同数，六亲先聚后散。男得良妻，女得贵夫。八牛人大吉（朱姓人）。\n后天卦：有口之人有君禄（口天为吴姓人），遇得贵人升青云。得官得禄有灾殃，舍云重利方是吉。\n｛倪注：战国旬子曰亡国有四兆：1、有服组（穿名牌）;2、有容妇（爱手饰）3、有欲淫 4、有志利（有自利）。｝\n流年卦：婚事吉，科甲中。求财有钱。得财需要闪。不可贪禄。求仕逢贵，心想事成！恐有燕。（恐怕会到南方去）\n\n【卦占卜故事】泽雷随䷐此卦孙膑破秦，卜得之，便知必胜也。\n\n【卦象图解】图中：云中雁传书，一堆钱，朱门内有人坐一人在门外立，地上一堆珠。\n良士琢玉之课 如水推车之\n\n【卦图象解】一、云中雁传书：飞来喜讯象。 \n二、一堆钱：财聚也。 \n三、朱门内有人坐：君王之象，必见君面也。 \n四、一人在斗外立地：乃士人求仕，受尊重之象。 \n五、串钱在地：有用利不行之象。 \n六、乱珠聚盆：先聚后散之象。\n  全卦：礼仪得体，有见速喜之象。"
  },
  {
    "id": 18,
    "name": "山风蛊",
    "hexagramSymbol": "䷑",
    "yaos": [
      "阴",
      "阳",
      "阳",
      "阴",
      "阴",
      "阳"
    ],
    "yaoci": [
      "初六：干父之盎，有子，考无咎，厉终吉。",
      "九二：干母之蛊，不可贞。",
      "九三：干父之蛊，小有悔，无大咎。",
      "六四：裕父之蛊，往见吝。",
      "六五：干父之蛊，用誉。",
      "上九：不事王侯，高尚其事。"
    ],
    "divinationDiagramName": "山风蛊象解",
    "divinationDiagram": "孩儿在云中，雁啣书，一鹿、一钱，男 女相拜。\n三蛊食血之课 以恶害义之",
    "explanation": "【卦象描述】山风蛊䷑ 三虫聚一盘中，互相争食，此成蛊象，吾人常见几位女性同居 一桌，东家长西家短的议论他人，此虽生是非之地，但并非成蛊 卦，此卦在阳宅上惟见之于男人，此又男女之不同，女人之蛊，吾 人可以立见，男人之蛊在心中，表面上不易看到。 \n一、此局男人图利野心至大，为达目的，往往不择手段。\n二、主发科甲，读书考试成绩必超人一等。 \n三、有早婚之象，比同时生人提前四年婚，且二位兄长尚未娶 妻，自己先娶。\n\n【命理解析】山风蛊䷑2223010\n先天卦：五才大限，女凶难防，须有天官，人貌不同。善知人意，大人状，主夭。积善之家必有余庆（可逃过）。（倪注：真善而不是愚善）祖 业有积，机深必败（心机绝不能太深）。早有功名，早婚。\n后天卦：金榜提名，自由人。不求名利，名利自来。财禄消化旺，无官带。男女合有利，机多必败（心机多心败）。｛倪注：心机深之人面象：裂舌，手横纹深｝\n流年卦：主科甲高中，婚事有成。从商合伙吉，须防人言生害。\n｛倪注：大智慧之人发生情况变化，首先想自己有没有错，小人反之。｝\n\n\n【卦占卜故事】山风蛊䷑此卦伯乐疗马，卜得知马难治，见三蛊同器 皿也。\n\n【卦象图解】图中：孩儿在云中，雁啣书，一鹿、一钱，男 女相拜。\n三蛊食血之课 以恶害义之\n\n【卦图象解】一、孩儿在云中：有天官促成也。不求名利之人。 \n二、雁啣书：有消息至。 \n三、一鹿：有大利也。 \n四、钱在空中：此心中图利之象也。 \n五、男女相拜：男女相合，此为利而结合，非正婚也。\n\n【卦义解读】以卦而言，男虽少但居"
  },
  {
    "id": 19,
    "name": "地泽临",
    "hexagramSymbol": "䷒",
    "yaos": [
      "阳",
      "阳",
      "阴",
      "阴",
      "阴",
      "阴"
    ],
    "yaoci": [
      "初九：咸临，贞吉。",
      "九二：咸临，吉无不利。",
      "六三：甘临，无攸利，既忧之，无咎。",
      "六四：至临，无咎。",
      "六五：知临，大君之宜，吉。",
      "上六：敦临，吉，无咎。"
    ],
    "divinationDiagramName": "地泽临象解",
    "divinationDiagram": "妇人乘风 一车上有使旗，人在山顶，虎在山下坐，一合子，人射弓。\n凤入鸡群之课 以上临下之",
    "explanation": "【卦象描述】地泽临䷒ 母居此局，因对象之卦为履，故有难为之象出现。已婚妇人居 此由于夫宫必无力，产生以下数种状况： 一、夫业受困，乃因妻之过刚，为求功心切，招致如此，请参 考履卦。 \n二、妻为委曲求全，而以力大居小，顺从于夫可也。 \n三、子女逢母如此，任何事皆有母来做主，以致母过烦忧，发 展权限过大，终致子女反弹，背逆其意行事，其招致如此，乃因母 亲无安全感，全心寄托在子女身上而成此特殊之心理状况。其结果 大家痛苦，而无法解决。 四、肖虎人居此局，婚事凶，主破，但于事业却能力争上游， 成就非凡。\n\n【命理解析】地泽临䷒2223610\n先天卦：乔木有凤来仪，阴多阳二。生在武官家，主大贵。陈连单使，发虎人。长弓之人，暗渡陈仓，先成后破（防张姓人）。\n后天卦：武将受困，逢张生害。云武从商，必为富人。遇美人，再任可出使，车行千里。防张生害，人至北千里。\n流年卦：婚事须防，虎生暗害。武官外调，出使他国。（等待吉）强进生事非，官司招人陷。\n\n【卦占卜故事】地泽临䷒此卦蔡琰去和番，卜得知，必还故国也。\n\n【卦象图解】图中：妇人乘风 一车上有使旗，人在山顶，虎在山下坐，一合子，人射弓。\n凤入鸡群之课 以上临下之\n\n【卦图象解】一、妇人乘风：外援为阴女，美人也。 \n二、一车上有使旗：出使之象，以谋略可解灾，谋之对象为女人也。连姓、车姓人。 \n三、人在山顶头：盛极将衰，招困也，即将下坡也。 \n四、虎在山下坐：人受虎困之象。 \n五、一合：先成后破象。 \n六、人射弓：张姓人士，夷狄之人，以弓射猎，故外族入侵象。 故自古天下安治，未有久而不乱者，皆因不能戒盛而已。"
  },
  {
    "id": 20,
    "name": "风地观",
    "hexagramSymbol": "䷓",
    "yaos": [
      "阴",
      "阴",
      "阴",
      "阴",
      "阳",
      "阳"
    ],
    "yaoci": [
      "初六：童观，小人无咎，君子吝。",
      "六二：闚观，利女贞。",
      "六三：观我生，进退。",
      "六四：观国之光，利用宾于王。",
      "九五：观我生，君子无咎。",
      "上九：观其生，君子无咎。"
    ],
    "divinationDiagramName": "风地观象解",
    "divinationDiagram": "日月当天，官人香案边立，鹿在山上，金甲人执印秤。\n云卷晴空之课 春花竞发之",
    "explanation": "【卦象描述】风地观䷓ 观卦之精义在以静观可以洞悉周围之事，黄帝之阴符经云： 「聋者善视。」即此意。但亦有缺失，岂不闻古言：「水至清则无 鱼，人至明则无徒」此卦唯长女可见，婚后局消。 \n一、其明在过明，而产生以财富论定是否愿意嫁人，造成如遇未有事业之男人，即使再爱也不愿结婚，宁可做有钱人的偏房，不 婚。 \n二、如逢命格婚姻有凶，则有嫁二婚夫，且对方有子之人，但 须比同时生人再加六年方成正式婚姻。 \n三、未婚前，女儿代母职，掌理一家大小之事，有姊如母，即 此局之人。 \n四、如遇命中为僧道命之人，则主终身不嫁。\n\n【命理解析】风地观䷓2230542\n先天卦：父母双全，人大吉。次子偏禄成事业。官人得印又称心。女子逢之恐为偏。\n后天卦：父全母失，为定数。财禄日增，官运通。逢辛逢乙，必增辉。火年需防，母有凶（午马为火年）。\n流年卦：逢之从升，诸事顺遂，路上平安。婚事可成，夫主贵。父母双全，人安康。\n\n【卦占卜故事】风地观䷓此卦唐明皇与叶静游月宫，卜得之，虽有好 事，必违也。\n\n【卦象图解】图中：日月当天，官人香案边立，鹿在山上，金甲人执印秤。\n云卷晴空之课 春花竞发之\n\n【卦图象解】一、日月当天：政治清明，普照大地，父母双全。 \n二、官人香案边立：倌人，丈夫也。蔡姓人士，神人共明之象。 \n三、鹿在山上：得高禄之象。 \n四、金甲人：君侧之人也，护卫也。 \n五、执印秤：提印信而来授权也。"
  },
  {
    "id": 21,
    "name": "火雷噬嗑",
    "hexagramSymbol": "䷔",
    "yaos": [
      "阳",
      "阴",
      "阴",
      "阳",
      "阴",
      "阳"
    ],
    "yaoci": [
      "初九：屦校灭趾，无咎。",
      "六二：噬肤灭鼻，无咎也。",
      "六三：噬腊肉遇毒，小吝，无咎。",
      "九四：噬干胏，得金矢，利艰贞，吉。",
      "六五：噬干肉，得黄金，贞厉，无咎。",
      "上九：何校灭耳，凶。"
    ],
    "divinationDiagramName": "火雷噬嗑象解",
    "divinationDiagram": "北斗星，妇人烧香拜，忧字不全，喜 字全，一雁食稻，一钱财，一鹿。\n日中爲喜之课 顺中有物之",
    "explanation": "【卦象描述】火雷噬嗑䷔ 成此之局法，请观录像带说明，于此不累述。吾人常见有女孩 小时即喜欢咬人，劝之不听，乃生噬嗑之象。 \n一、此女性刚，报复手段常用咬的，平日唠叨不停。 \n二、婚姻对象为阴柔之男人。 \n三、本身想法动作一如男人，且主少年有成，故常见年轻之影 剧圈出身小姐，名气很大，少年得志，都属此局。 四、婚事延后六年，故同时生人如为二十六岁婚，则此局人加 六年，成为三十二岁婚。 \n五、事业非常顺利，但如为肖鸡之女性逢之，其果必坐吃山 空，吾人常见的有未婚妾成此局，也有离婚之女成此局，但须与寡 母同住一起，方成此局。为何如此，学者须看录像带说明。\n\n【命理解析】火雷噬嗑䷔2230920\n先天卦：生为尾胎，在豪门。足踏七星，发男儿。多败多成，为从商。从官从武，位到极品。\n后天卦：清香一柱为夫君。所求未果，逢鸡忧财。女人逢之，枯坐到老。求财如镜中日月，可遇不遇。\n流年卦:防盗，尤失财。再度无功名。心诚求上天，肖鸡能食果。\n\n\n【卦占卜故事】火雷噬嗑䷔此卦苏秦说六国，卜得之，后为六国丞相。\n\n【卦象图解】图中：北斗星，妇人烧香拜，忧字不全，喜 字全，一雁食稻，一钱财，一鹿。\n日中爲喜之课 顺中有物之\n\n【卦图象解】一、北斗星：君王也，夫君也，公职也。 \n二、妇人烧香拜：妻于人事无助，乃求助于天。 \n三、忧字不全喜字全：乃无又喜象。 \n四、一鸡食稻：果被食，无果也。 \n五、一钱财、一鹿者：于财禄事忧心忡忡也。 \n六、禽：字解为『离多会少』之象。\n\n【卦义解读】此卦才有刚有柔，分而不杂，为明辨之象。察狱之本即明辨，以明而动，"
  },
  {
    "id": 22,
    "name": "山火贲",
    "hexagramSymbol": "䷕",
    "yaos": [
      "阳",
      "阴",
      "阳",
      "阴",
      "阴",
      "阳"
    ],
    "yaoci": [
      "初九：贲其趾，舍车而徒。",
      "六二：贲其须。",
      "九三：贲如濡如，永贞，吉。",
      "六四：贲如皤如，白马翰如，匪寇婚媾。",
      "六五：贲于丘园，束帛戋戋，吝，终吉。",
      "上九：白贲，无咎。"
    ],
    "divinationDiagramName": "山火贲象解",
    "divinationDiagram": "雨下，车行路舟张帆江中，官人着公 服登梯，仙女云中执珪。 服登梯，仙女云中执珪。\n猛虎靠岩之课 光明通泰之",
    "explanation": "【卦象描述】山火贲䷕ 贲卦为求外饰之道，其之于人事，惟男人居此局中成格。诸君 试想一位堂堂男子汉，如果要外饰，其目的何在呢？因为有真内实 之人，其心但求充实，必舍外饰之道，不会花心思刻意去修饰。君 不见真正有钱，有高智慧之人，其外观往往很零乱，甚至衣服反穿 而不自知，其原因在他根本不想花心思在这方面，你有同感吗？ \n一、男身女态之象，性喜夸张矫作之服饰。 \n二、个性好动，不耐静守，又刚烈主见强，性易怒。 \n三、婚姻延后，三十岁以后进退失据，吾人常见空服人员及影 剧圈人士居此局中而不自知。 \n四、此局以科甲，声名，故利考试。同时生人会考试成绩不 同，有人名落孙山，地理之格局影响深远矣。\n\n【命理解析】山火贲䷕2231340\n先天卦：先生英明为官带。出使四方为人重。前途有有助，不须云问津。长弓之人行巷道，排列第三。不出江中为定数，排列第一。\n后天卦：平步青云，位至三公。禄命天上来，声名远播。\n流年卦：男女同心，升官迁动。待势而发，此行大利。逢科甲高中，长弓行险路终凶。\n\n【卦占卜故事】山火贲䷕此卦管鲍卜得之，果获全，彼此相逊，终显 名义也。\n\n【卦象图解】图中：雨下，车行路舟张帆江中，官人着公 服登梯，仙女云中执珪。 服登梯，仙女云中执珪。\n猛虎靠岩之课 光明通泰之\n\n【卦图象解】一、雨下：满也，润泽也，成也。\n二、车行路：前往任官象，行走四方也。 \n三、舟张帆在江中：此行顺风大利也。 \n四 、官人着公服登梯：升迁在外地象。任公职主官外调象。丈夫从公职升官也。 \n五、仙女云中执珪：受阴人提携象。"
  },
  {
    "id": 23,
    "name": "山地剥",
    "hexagramSymbol": "䷖",
    "yaos": [
      "阴",
      "阴",
      "阴",
      "阴",
      "阴",
      "阳"
    ],
    "yaoci": [
      "初六：剥床以足，蔑贞，凶。",
      "六二：剥床以辨，蔑贞凶。",
      "六三：剥之，无咎。",
      "六四：剥床以肤，凶。",
      "六五：贯鱼，以宫人宠，无不利。",
      "上九：硕果不食，君子得舆，小人剥庐。"
    ],
    "divinationDiagramName": "山地剥象解",
    "divinationDiagram": "妇人床上坐，风中烛，葫芦在地，山 下官人坐，冠巾挂木上，一结乱丝。\n去旧生新之课 群阴剥尽之",
    "explanation": "【卦象描述】山地剥䷖ 剥有耗尽之象，有人家财万贯，但出一子耗尽家财，所谓富不 过三代，其因何在？有时见三老人，居老人院中，本是安养天年与 世无争，三人结拜兄弟后，长幼有序分列，此时如剥卦现，则其中 一人必散尽三人之财务，终至引发自杀或仇杀事件，其因皆为财， 世人但知为财杀，却永远无法深入了解，为何贪财如此？为何年至 古稀，仍无法摆脱财利之惑？皆不知卦局之影响，乃能深入人心， 使当事人蜕变而不自知，终致晚节不保，学者须戒之，一旦发现此局已成，必极尽人事破坏此局，免生大害，徒呼奈何？ \n一、家有剥卦，主耗破家业，伦理丧失，伤风败俗。 \n二、性毒暗生，害人而人不知。 \n三、婚事不成，同时生人即令流年红鸾星动，亦无法成婚。 \n四、科甲不顺，考试必败。 五、身体灾病多，折损阳寿。 此局大凶，学者须能于事初即可判读出，必可趋吉避凶，乃至 大吉，功德无量，同道须知，助人于无形，受助人不自知，无法察 觉到你的功劳，此其功德也，即阴德。今人捐募善款，为穷人洗 衣、做饭、只是阳德，并非真功德。圣人治世，天下百姓，只知平 安，无乱，无法感受到圣贤的功劳，庸才治世，天下大乱，其派人 平乱后，人民见此，即认定其功劳很大，所以本书之出世，有警世 教民之无知功效，同道共勉之。\n\n【命理解析】山地剥䷖2231820\n先天卦：家人离，财禄散。生不逢时，天注定。父母失和，人丁少。性情孤僻，志善变。行事取巧，事倍功半。解：只可守株待兔，不可缘木求鱼。\n后天卦：退早无功，仍緾讼。阴人生害不自知。尤以富阴更可怕（当事人知道是谁）。知人知面不知心。守成不中介踰矩，一动贪念必招凶。\n流年卦：婚事不成，科甲不中。愈理愈乱。（倪注：剥自内心）女命防夫（克夫），闭门造车，其果自食。｛倪注：世间很多没有的东西都是女人造出来的，如妻子重要还是老妈重要。“爽”字为凶多吉少。｝\n\n【卦占卜故事】山地剥䷖此卦尉迟将军与金牙斗争，卜得之，不利男子。\n\n【卦象图解】图中：妇人床上坐，风中烛，葫芦在地，山 下官人坐，冠巾挂木上，一结乱丝。\n去旧生新之课 群阴剥尽之\n\n【卦图象解】一、妇人床上坐：必有暗灾，阴人得势，阳道衰弱，小人为主官。 \n二、烛在风中：险也。 \n三、葫芦：医药无救也；有暗计也。 \n四、缫丝：事务繁冗。 \n五、山下官人坐：有靠山，但阴人为祸。 \n六、冠巾挂木上：求去之象；又有乐之象。\n\n【卦义解读】君子处剥之时，知不可往，顺时而止，乃因能观剥也。故此卦有顺止之象，为处剥之道。 君子之人见事于始，凡事之始皆有理，君子视其盈亏消息，而知处之道。顺时则吉，逆时则凶， 故君子事天。小人反之，不见事始之作为如何，不论事理之盈亏如何，一昧迎随奉承，故小人 事人。 象曰：山附于地，剥，"
  },
  {
    "id": 24,
    "name": "地雷复",
    "hexagramSymbol": "䷗",
    "yaos": [
      "阳",
      "阴",
      "阴",
      "阴",
      "阴",
      "阴"
    ],
    "yaoci": [
      "初九：不远复，无祇悔，元吉。",
      "六二：休复，吉。",
      "六三：频复，厉，无咎。",
      "六四：中行独复。",
      "六五：敦复，无悔。",
      "上六：迷复，凶，有灾眚，用行师，终有大败，以其国君凶，至于十年不克征。"
    ],
    "divinationDiagramName": "地雷复象解",
    "divinationDiagram": "官人乘车，上两只旗，堠上东字将持刀立，一兔一虎。\n淘沙见金之课 反复往来之",
    "explanation": "【卦象描述】地雷复䷗ 吾人常见已婚之妇人，婚事不佳，独立支撑家运，允文允武， 属木兰型之人，必为复卦之局。 \n一、有女身男人性格之征。 \n二、此卦局尤利发武官，即军、警、法、外交等工作之人。 \n三、代夫出征，丝毫不让须眉。 \n四、此局发官人，不发商人，尤以肖虎、兔人大吉，更旺。\n五、与夫之对应局为无妄卦，故夫妻必不和，其因乃生于妻志 过丈夫，丈夫无法与其匹配，屋漏偏逢连夜雨，加上夫有官司是非 缠身，所以对婚姻来说是加凶。\n\n【命理解析】地雷复䷗2232450\n先天卦：天生神武，好勇之人。女人逢之，为英雌。（如花木兰似的人）虎兔之人化为将。手握生杀之权，猴向东行出外地。一父双母，璞玉不相识（兄弟不相识）。淘沙始见金。\n后天卦：官爵显要，发猴虎兔（侯、王、刘姓）。一人两妻，反复往来。逢刘逢宋招遇阻。迁往他处可平安。\n流年卦：行年至此升将官，木形肖猴。再遇虎兔寅卯年，必可复职任大使。\n东字：人未登车。\n\n【卦占卜故事】地雷复䷗此卦唐太宗归天，卜得之，七日复还魂也。\n\n【卦象图解】图中：官人乘车，上两只旗，堠上东字将持刀立，一兔一虎。\n淘沙见金之课 反复往来之\n\n【卦图象解】一、官人乘车：使节也；车姓、连姓也；军队也；官大也；调职也。 \n二、上两只旗：斗也；将、帅也；一方之主也。 \n三、堠上东字：猴发木形人。东：有心约束，十八日至。十日来人封侯象。 \n四、一将持刀立：武威之人，司法执行人。 \n五、一兔：肖兔之人，刘姓之人。 \n六、一虎：肖虎之人，王姓之人。\n 此卦云：君子之道，既消而复，始复必不能力胜小人，必待其朋类渐盛，协力致胜可也。\n\n【卦义解读】此以卦才来论，复之道，阳刚因消弱至极而反来，其法动而取顺行法，是故出入皆无灾， 朋之来，亦因顺而动来也。 反复其道，七日来复，天行也。利有攸往，刚长也；复其见天地之 心乎！ 复之返来，顺天之运行，故言七日。因君子道长，故利前往，阳复生于下，乃是天地生物 之心，以为动之始也，故外见动，而始生于内也。 象曰：雷在地中，复。先王以至日闭关，商旅不行，后不省方。 以卦象而言，如雷乃阴阳相搏而成声，时阳之微，未能发也。如圣人顺天之道，于日阳之始生，安静养之以闭关，使商旅不得行，人君不视"
  },
  {
    "id": 25,
    "name": "天雷无妄",
    "hexagramSymbol": "䷘",
    "yaos": [
      "阳",
      "阴",
      "阴",
      "阳",
      "阳",
      "阳"
    ],
    "yaoci": [
      "初九：无妄，往吉。",
      "六二：不耕获，不菑畬，则利有攸往。",
      "六三：无妄之灾，或系之牛，行人之得，邑人之灾。",
      "九四：可贞，无咎。",
      "九五：无亡之疾，勿药有喜。",
      "上九：无妄，行有眚，无攸利。"
    ],
    "divinationDiagramName": "天雷无妄象解",
    "divinationDiagram": "官人射鹿，鹿啣文书，钱一堆在水 中，一鼠一猪。\n石中蕴玉之课 守旧安常之",
    "explanation": "【卦象描述】天雷无妄䷘ 此名无妄，犹无妄之灾意，居此局之丈夫成此格，即令已离婚 但有子女同住，只要象存在，其局不变。须注意此点。 \n一、必须为从商较吉，但须防阴人暗客，有得财遇险之象，肖 猪肖鼠人成格，主大财入，但皆有阴谋其中。 \n二、如为公职人，则易流于利欲而挺身走险。 \n三、求财招险事，住满第二年，局再不动，必见之。 四、性刚固执，不听人言，故生小人，自乱阵脚。 五、须防子灾，故同时生人，有人无子，有人有子，但主夭折 或叛逆，此其真因也。因强住长子位，致令长子无宫位，故生祸 害。\n\n【命理解析】天雷无妄䷘2233110\n先天卦：生逢鼠猪人须防。若大家业分东西。刚断用事，险中求财。商人行，合伙防陷。有大禄至，须戒盛。\n后天卦：猪年人进禄为天数。少缺一半，阴人有谋略。不抱侥倖可脱险。留得青山在不怕没柴烧。\n流年卦：险中求财，有半，自乱阵脚。防窃，忧心父病（面象：口角处暗暗的）。\n\n【卦占卜故事】天雷无妄䷘此卦李广，卜得之，后凡为事皆不利也。\n\n【卦象图解】图中：官人射鹿，鹿啣文书，钱一堆在水 中，一鼠一猪。\n石中蕴玉之课 守旧安常之\n\n【卦图象解】一、官人射鹿：自乱阵脚。 \n二、鹿啣文书：财讯至也。 \n三、钱一堆在水中：得财遇险之象。险中求财，忧心忡忡也。 \n四、一鼠一猪：遇子、亥年吉，肖鼠人阴谋，肖猪人黑心。 又可以子、亥为孩，亦即孩无子为亥，缺子象。又六字不全，亥月凶，无尾凶， 不足六岁，为五岁凶死。 天机象：犬、猪、牛、羊：叱之即去。鸡、鱼、鹅、鸭：欲用则不生。\n\n【卦义解读】此位为卦之极，无妄已至善，人至无妄， 又复行，理必过也。过于理，则生妄。\n象曰：无妄之行，穷之灾也。 无妄已为极点，今又复加进，乃生妄矣， 故穷极而生灾也。"
  },
  {
    "id": 26,
    "name": "山天大畜",
    "hexagramSymbol": "䷙",
    "yaos": [
      "阳",
      "阳",
      "阳",
      "阴",
      "阴",
      "阳"
    ],
    "yaoci": [
      "初九：有厉，利己。",
      "九二：舆说輹。",
      "九三：良马逐，利艰贞，曰闲舆卫，利有攸往。",
      "六四：童牛之牿，元吉。",
      "六五：豶豕之牙，吉。",
      "上九：何天之衢，亨。"
    ],
    "divinationDiagramName": "山天大畜象解",
    "divinationDiagram": "人在望竿头立，车在泥中，犬头上回字，人射文书，刀在牛上，一合子。\n龙困浅水之课 万物如生之",
    "explanation": "【卦象描述】山天大畜䷙ 君不见有子为家不顾一切的工作，处处为家着想，甚至放弃婚 事亦在所不惜，固然此象不一定在三子身上发生，但大畜卦必现于 三子身上。 \n一、代父之职守，负担一家之生计。 \n二、节俭至矣，绝不招待花钱买奢侈品，故颇有积蓄。\n三、有婚也短暂，必不足三月而破，比同时生人提前二年结婚。\n四、此局不利公职发展，必困于工作，堆积公文如山。 人言有积乃大，诚不欺人也，许多人在婚前极尽节俭，往往婚 后无法忍受妻子之奢侈浪费，终致离婚，故积的观念产生在自己身 上而不自觉，乃致婚后，硬要加诸于对方身上，终于破裂，吾人当 于始时，即已察觉知晓，方不愧为习易之人。\n\n【命理解析】山天大畜䷙2233610\n先天卦：生来注定富贵人。红楼之中有科甲，马人大吉。求官不利，求财大吉。经营交易，一生富足。\n后天卦：休辞官位，专心从商。得祖艺，守成不易。不犯桃花，果必成。财禄富足一身。\n流年卦：遥望国土思故乡。身在异乡为异客。财禄兴旺，滚滚而来。天机道：文书至，必度势而进。不可犯灾而行，官人逢之贪禄休官。\n\n【卦占卜故事】山天大畜䷙此卦季布遇难，卜得之汉推其忠，乃赦其罪。\n\n【卦象图解】图中：人在望竿头立，车在泥中，犬头上回字，人射文书，刀在牛上，一合子。\n龙困浅水之课 万物如生之\n\n【卦图象解】一、人在望竿头上立：此不明局势之屯难时也，不可妄动也。 \n二、犬上回字：乃肖狗之人，狗年，狄姓之人，果为哭之象。 \n三、车在泥中：进退两难之象。刀在牛上：解也，牛为贵人象。 \n四、人射文书：张姓，小人阻碍也。射：同音，色也，绯闻。 \n五、牛不顺道：背道而驰，反其道而为之，吉。 \n六、人望：人亡也。 \n七、人立：在位也。 \n八、盒：先成后破。 \n九、牛回头视犬：计无所出，待也。 卜得此卦：动于险中，先成后破也。"
  },
  {
    "id": 27,
    "name": "山雷颐",
    "hexagramSymbol": "䷚",
    "yaos": [
      "阳",
      "阴",
      "阴",
      "阴",
      "阴",
      "阳"
    ],
    "yaoci": [
      "初九：舍尔灵龟，观我朵颐，凶。",
      "六二：顚颐，拂经，于丘颐，征凶。",
      "六三：拂颐，贞凶，十年勿用，无攸利。",
      "六四：顚颐，吉，虎视眈眈，其欲逐逐，无咎。",
      "六五：拂经，居贞吉，不可涉大川。",
      "上九：由颐，厉吉，利涉大川。"
    ],
    "divinationDiagramName": "山雷颐象解",
    "divinationDiagram": "雨下，三小儿，日当天，香案，金紫官 人引一人。\n龙隐清潭之课 迁善远恶之",
    "explanation": "【卦象描述】山雷颐䷚ 颐有饮食养身之意，如何养人？如何养正？如何知养之正确与 否？何时可养？这些零碎复杂的问题，如要一一解释，不一定全部 都能知道了解，八卦之入宅变局，就是取自然颐养之道，使萌生之 始念，由己之所需要，人之性在其认为极需要之时，你提供所需方 可真正受用，如果他本身不想要，即令是你的亲人也无法改变他， 只造成热脸贴到冷屁股的结果。故吾人能参透易经，用阳宅方式， 自然而然的大幅改变，其本人而不自知，相信是最有效的方法。此 卦现则可见： \n一、少年得志，早来兴发之象。 \n二、身体健康平安，故同时生人如身体差，吾人可利用此局来 化解，协助他吸取自然之精华，并能包含其情绪在内。 \n三、婚姻当较同时生人提前五年，有早婚之倾向。\n四、如不经吾同道之人指点（属易派象术宗），自然居此，有时甚至于为其他风水地理师所改，皆主同父异母之人，反观之，为 同父异母之人，却居此局中，屡见不鲜。\n\n【命理解析】山雷颐䷚2240340\n先天卦：生则从父，母有凶（父母不全）。妻一子，妾二子。少受封禄，才艺高。一生正事正官带。求官得官，得父庇荫。兄弟齐心，相互呼应。官发长房（大儿子）余发禄。天机道：出盖头丁人，日月明德。\n后天卦：得众望，受天子禄命。民选吉，平步青云，近天子侧。位列三台。\n流年卦：求财平安，求官大利，婚事必成。\n\n【卦占卜故事】山雷颐䷚此卦张骞寻黄河源，卜得之，乃知登天位也。\n\n【卦象图解】图中：雨下，三小儿，日当天，香案，金紫官 人引一人。\n龙隐清潭之课 迁善远恶之\n\n【卦图象解】一、雨下：受恩泽也。 \n二、三小儿：乃合心之象，有德之国也。 \n三、日当天：君明之象。父全。 \n四、香案：求取之象。 \n五、金紫官人：天子身侧之人。 \n六、引一人：提携，推荐也。"
  },
  {
    "id": 28,
    "name": "泽风大过",
    "hexagramSymbol": "䷛",
    "yaos": [
      "阴",
      "阳",
      "阳",
      "阳",
      "阳",
      "阴"
    ],
    "yaoci": [
      "初六：藉用白茅，无咎。",
      "九二：枯阳生稊，老夫得其女妻，无不利。",
      "九三：栋桡，凶。",
      "九四：栋隆，吉，有它吝。",
      "九五：枯杨生华，老妇得其士夫，无咎无誉。",
      "上六：过涉灭顶，凶，无咎。"
    ],
    "divinationDiagramName": "泽风大过象解",
    "divinationDiagram": "官人乘车上，插两旗，旗上有喜字，入朱门， ，门外贵人立，文书在地，一合子。 \n寒木生花之课 本末俱弱之",
    "explanation": "【卦象描述】泽风大过䷛ 大过之卦，于人事上分二解，一为犯下大过，二为立下大过于 常人之功。地脉道比较偏狭，往往见到小妹最早嫁人，也嫁的最 好，必为此卦。至于何时为大过，如何用大过之道，其进退之机， 读者可参看人间道部份，此不详述。 \n一、比同时生人早婚三年，且嫁夫有长十岁以上之状况。 \n二、身进豪门世家，享尽荣华富贵。 \n三、性过刚，任意而为，婚前婚后都一样。 \n四、如婚之对象，年纪相近，必主凶，易破。\n\n【命理解析】泽风大过䷛2310001\n先天卦：北人南相，主大贵。一人两母为定数。南人北相，主大富。姐妹共事一夫。八牛之人，终成空，先官后商。外柔内刚，仁心之人。\n后天卦：有栋梁之才，无科甲之实。受人重用，处事不贞。婚事有破，不知取舍。\n流年卦：（倪注：流年很重要，先天卦还要加减，流年卦直接批出来就是了）官司有讼，婚事不成。任官有凶，先成后破。女命逢之，嫁入豪门。\n\n【卦占卜故事】泽风大过䷛此卦姜太公钓渭水，卜之，至八十方遇文王。\n\n【卦象图解】图中：官人乘车上，插两旗，旗上有喜字，入朱门， ，门外贵人立，文书在地，一合子。 \n寒木生花之课 本末俱弱之\n\n【卦图象解】一、官人乘车上插两旗：车至官来，必有官司诉讼，军人象。 \n二、旗上有喜字且分开，乃喜有破损象，舍去婚姻象。 三、入朱斗：乃豪门世家相请，或朱姓人。 \n四，、门外贵人立：被弃于外象。 \n五、文书在地：合约，契约，不成之象。 \n六、一合子：先成后破之象。"
  },
  {
    "id": 29,
    "name": "坎为水",
    "hexagramSymbol": "䷜",
    "yaos": [
      "阴",
      "阳",
      "阴",
      "阴",
      "阳",
      "阴"
    ],
    "yaoci": [
      "初六：习坎，入于坎窞窞窞窞，凶。",
      "九二：坎有险，求小得。",
      "六三：来之坎坎，险且枕，入于坎富，勿用。",
      "六四：樽酒，簋贰，用缶，纳约自牖，终无咎。",
      "九五：坎不盈，衹。",
      "上六：系用徽纆纆纆纆，，，，寘寘寘寘于丛棘，三岁不得，凶。"
    ],
    "divinationDiagramName": "坎为水象解",
    "divinationDiagram": "人在井中，人用绳引出，一牛一鼠，人 身虎头。\n船涉重滩之课 外虚中实之",
    "explanation": "【卦象描述】坎为水䷜ 本坎卦有险之象，位居正北，罗经上是子位，吾人常见四合院 宅式，皆坐北向南，入宅后以中心点为准，其正北宫常设祖先牌 位，神明所在或大厅所在，不居人，其因就是此位有险，故以神明 续之，今人不知，无意之间此局现，则成次子格，可以发现： \n一、儿子喜欢冒险，诸如赌博、毒品等举凡惊险刺激都有兴 趣。 \n二、唯肖虎，肖牛人住吉。\n三、如此子肖鼠，又成此局，则暗中生害，为祸家人，母亲必 首当其冲。 \n四、婚姻较同时生人，延后二年。 \n五、此格之人，常犯官司，牢狱之灾。 解此局惟水火既济卦可成，可令其脱胎换骨。\n\n【命理解析】坎为水䷜2310501\n先天卦：出入艰险，祸害暗生。处险不自知，牢狱官司难逃。不做官人爵禄显。只在绿林称英雄（黑社会）。外地吉，迁向西方。逢牛逢鼠为得助，贵人为一大头人。\n后天卦：牢狱之灾，难脱。失却家人，又行险。任劳任苦，无怨忧，安分守纪。虎头人，能脱险，牛鼠人必陷。\n流年卦 ：必有官讼，牢狱之灾。秋冬吉，春夏凶，鼠有伤，牛平安。虎人逢之反吉（肖虎、姓王、象虎、司法官）。\n\n【卦占卜故事】坎为水䷜此卦唐玄宗避禄山，卜得之，果身出九重也。\n\n【卦象图解】图中：人在井中，人用绳引出，一牛一鼠，人 身虎头。\n船涉重滩之课 外虚中实之\n\n【卦图象解】一、人在井中：官司，牢狱，陷入险地象。 \n二、人用绳引出：责人出手相救状。 \n三、一牛：劳苦也，春夏凶，秋冬吉，亦肖牛人。 \n四、一鼠：肖鼠人，阴谋暗害者，暗藏也。 \n五、人身虎头：有权威之人，贵人也。"
  },
  {
    "id": 30,
    "name": "离为火",
    "hexagramSymbol": "䷝",
    "yaos": [
      "阳",
      "阴",
      "阳",
      "阳",
      "阴",
      "阳"
    ],
    "yaoci": [
      "初九：履错然，敬之，无咎。",
      "六二：黄离，元吉。",
      "九三：日昃之离，不鼓缶而歌，则大耋之嗟，凶。",
      "九四：突如、其来如、焚如、死如、弃如。",
      "六五：出涕沱若，戚嗟若，吉。",
      "上九：王用出征，有嘉。"
    ],
    "divinationDiagramName": "离为火象解",
    "divinationDiagram": "人在虎背上立，官人执箭在岸上立，水中有船，二人分立两岸。\n飞禽在网之课 大明当天之",
    "explanation": "【卦象描述】离为火䷝ 此局常见，离卦本示人中虚为明，今人但以为自己很明，其实 一直都没进步，屡错不改，茫然不知，皆肇因于不明，易经提出之 中虚为明，就是随时把自己变成空杯子，那才可以真明。家中有 女，天生好手，明事理，知进退，必为此局，读者须注意要知利用 此局方是，不知运用，空言易经，吾所不耻。 \n一、此女必心在迁移外地，不喜在本地。 \n二、命格上如二十八岁婚，则宅局如此，必然不出二十八岁 婚。 \n三、天生明理而不惧。 \n四、不守财禄，不重利之人。 \n五、科甲高中，往往都是第一志愿。\n\n【命理解析】离为火䷝2311140\n先天卦：性喜飘荡，无所适从。父留母失，两地相隔。文章才艺出众，但不聚财。结而离，离而结，婚事无定局。\n后天卦：虽无方向，行危不惧，去（行）吉，止（停）凶。婚有失妻之虑，寅年遇虎有大变。财散人离。\n流年卦：心有忧虑，方向不明，行危不惧方是真。从官逢暗箭。财禄婚事两不吉。\n\n【卦占卜故事】离为火䷝此卦朱买臣被妻弃时，卜得之，知身必贵也。\n\n【卦象图解】图中：人在虎背上立，官人执箭在岸上立，水中有船，二人分立两岸。\n飞禽在网之课 大明当天之\n\n【卦图象解】一、人在虎背上立：行危不惧；难下也。 \n二、 一船在江心：口舌相争，无所适从也。 \n三、官人执箭岸上立：在位之人，欲杀之象。 此卦夫妻破散成仇，兄弟分家各自为王之课。\n\n【卦义解读】此卦若云两离，则只见明，而不知继明之德。君子观离明相继之象，知本身之明德能济天 下，为使以明德中正永传后世，则须有进一步继明之能，能明于选择何人能承继，乃继明之义。 如尧之择舜，汉之萧规曹随等即是继明之用。"
  },
  {
    "id": 31,
    "name": "泽山咸",
    "hexagramSymbol": "䷞",
    "yaos": [
      "阴",
      "阴",
      "阳",
      "阳",
      "阳",
      "阴"
    ],
    "yaoci": [
      "初六：咸其拇。",
      "六二：咸其腓，凶，居吉。",
      "九三：咸其股，执其随，往吝。",
      "九四：贞吉，悔亡，憧憧往来，朋从尔思。",
      "九五：咸其脢脢脢脢，无悔。",
      "上六：咸其辅，颊，舌。"
    ],
    "divinationDiagramName": "泽山咸象解",
    "divinationDiagram": "空中有一拳，钱宝一堆，贵人在山顶， 女人上山，一合子。\n山泽通气之课 至诚感神之",
    "explanation": "【卦象描述】泽山咸䷞ 此卦局过去常见，今人不多，但读者亦明了，其变化如后： \n一、婚成于媒妁之言，并非自由恋爱。\n二、婚事先成后破，凶。 \n三、对象必为豪门世家，比同时生人早一年婚，逢单岁婚。 四、财禄事业顺利，工作野心大，但科甲不兴。\n\n【命理解析】泽山咸䷞2311620\n先天卦：生即带财来，注定继子承家业。巳年命，子亦常无。财禄收丰，田园必增。午火之时，婚事成，女有贵夫，男有美妻。\n后天卦：官至一方之主，孤产无援。贤妻助（内）力大，得之反为凶。女命逢之，助夫反害夫。\n流年卦：凭空而得，权爵位。商人逢之，得财，女人升职。官人逢之，须退，否则招凶。\n\n\n【卦占卜故事】泽山咸䷞此卦汉王昭君，卜得之，知和番不回也。\n\n【卦象图解】图中：空中有一拳，钱宝一堆，贵人在山顶， 女人上山，一合子。\n山泽通气之课 至诚感神之\n\n【卦图象解】一、空中有一拳：贵人提拔，凭空而得。 \n二、钱宝一堆：求财得财。 \n三、贵人在山顶：孤立状，即将下坡，退休状。 \n四、女人上山：夫妻吉，阴人卜之知走马上任。 \n五、合子：先成后破，因诚感方吉，物感必凶。"
  },
  {
    "id": 32,
    "name": "雷风恒",
    "hexagramSymbol": "䷟",
    "yaos": [
      "阴",
      "阳",
      "阳",
      "阳",
      "阴",
      "阴"
    ],
    "yaoci": [
      "初六：浚恒，贞凶，无攸利。",
      "九二：悔亡。",
      "九三：不恒其德，或承之羞，贞吝。",
      "九四：田无禽。",
      "六五：恒其德，贞，妇人吉，夫子凶。",
      "上六：振恒，凶。"
    ],
    "divinationDiagramName": "雷风恒象解",
    "divinationDiagram": "日在云，凤啣书，官人行路，道士手 指门，鼠下两口，墙挡路。\n日月常明之课 四时不没之",
    "explanation": "【卦象描述】雷风恒䷟ 今人最常见此局，化解局式，如雷地豫卦等都吉。 \n一、易从宗教信仰，但不是正道之宗教。 \n二、比同时生人晚婚一年。 \n三、智慧被压抑，常不知取舍，失去坚持。 \n四、肖鼠人有吉，阴谋不生。 \n五、官运不佳，商场不顺，惟科甲旺，利教职自由业人。\n\n【命理解析】雷风恒䷟2312050\n先天卦：肖鼠两口人，早年入空门，因无日头。明心见性，说法谈经，生俱佛性。此身不入官家门，必然为僧侣。\n后天卦：政局不清，君不明。身入空门，免招凶。待得子年方出头，有凤来仪，明且吉。\n流年卦：婚事成，科甲无。官运变动，远方吉。看似升官，实有险，（选外地吉）。早早脱身，免招陷。\n｛倪注：易经所有的推命流年，如紫微斗数、子平法等只占1/3的命，我们用人间道和地脉道一下就可改掉他。｝\n\n【卦占卜故事】雷风恒䷟此卦宋王夺韩朋妻，卜，得之也。\n\n【卦象图解】图中：日在云，凤啣书，官人行路，道士手 指门，鼠下两口，墙挡路。\n日月常明之课 四时不没之\n\n【卦图象解】一、日在云中：昏暗之象，君主不明象。 \n二 、凤啣书：喜讯至，金榜题名也。 \n三、官人行路：将至也，贵人至。官人，倌人，丈夫也，人傍为倌也。 \n四、道士手指斗：入空门也，闪也。 \n五、鼠下两口：阴谋在后之象；两口，回也，吕姓也。 六、时机：在春末，日为春之末尾也。 此即持之以恒，则有拨云见日之喜也。"
  },
  {
    "id": 33,
    "name": "天山遯",
    "hexagramSymbol": "䷠",
    "yaos": [
      "阴",
      "阴",
      "阳",
      "阳",
      "阳",
      "阳"
    ],
    "yaoci": [
      "初六：遯遯遯遯尾，厉，勿用有攸往。",
      "六二：执之用黄牛之革，莫之胜说。",
      "九三：系遯遯遯遯，有疾厉，畜臣妾，吉。",
      "九四：好遯遯遯遯，君子吉，小人否。",
      "九五：嘉遯遯遯遯，贞吉。",
      "上九：肥遯遯遯遯，无不利。"
    ],
    "divinationDiagramName": "天山遯象解",
    "divinationDiagram": "一山，一水，酒旗上文字，官人踏龟，月半云中，幞头上树，树下人独酌。\n豹隐南山之课 守道去恶之",
    "explanation": "【卦象描述】天山遯[dùn]䷠ 吾人常见一家之主终日咳声叹气，中年即无斡劲，且工作上付 出劳力很多，却往往功给他人，仕途原地踏步，毫无进展，必为此 卦而所约束也。 \n一、萌生退意，肇因于该升不升，有无力感 \n二、夫妻感情退化，终致离婚。 \n三、事事回归原地，必须重新出发。 \n四、身体亦有退化现象，中年即得老年病。\n\n【命理解析】天山遯[dùn]䷠2312540\n先天卦：父不全，母亦半。盖头高耳有，人成格。有险有阻，劳多功少。半母又多病，中年失官，餐饮吉。女命逢之，中年丧偶。\n后天卦：女命夫先失，辛劳成家，外阻 内险。男命辞官归隐，无所事。求财遇险，防人不成。（渔业平安）\n流年卦：父凶之年，官运停滞，财禄无。险在南山，女命逢之夫凶。事业不明。\n｛倪注：不管遇到什么险，去学习通通是平安的。｝\n\n【卦占卜故事】恒者，久也，久不动则有去意，遯乃退也，故遯所以继恒也，此卦天下有山，天阳向上， 物虽上陵但止而不进，以阴阳之道论，二阴居下有上进之势，阳将消退，故此时乃论小人渐盛， 君子退避之时，此遯之义也。\n\n【卦象图解】图中：一山，一水，酒旗上文字，官人踏龟，月半云中，幞头上树，树下人独酌。\n豹隐南山之课 守道去恶之\n\n【卦图象解】一、一山：阻也。 \n二、一水：险也。 \n三、酒旗上文字：酒为忘忧之物，文在旗上，受人提携也。 \n四、官人踏龟：归，鬼也；玄武自来，水上求财。 \n五、幞头上树：求去辞官也。 \n六、月在云中：主半清半浊象，事未明晰。 \n七、人在水边：等待平安状，莅临也。 \n八、树下人独酌：休也，无事也，萌生退意状。"
  },
  {
    "id": 34,
    "name": "雷天大壮",
    "hexagramSymbol": "䷡",
    "yaos": [
      "阳",
      "阳",
      "阳",
      "阳",
      "阴",
      "阴"
    ],
    "yaoci": [
      "初九：壮于趾，征凶，有孚。",
      "九二：贞吉。",
      "九三：小人用壮，君子用罔。",
      "九四：贞吉，悔亡，藩决不羸，壮于大舆之复。",
      "六五：丧羊于易，无悔。",
      "上六：羝羊触藩，不能退，不能遂，无攸利，艰则吉。"
    ],
    "divinationDiagramName": "雷天大壮象解",
    "divinationDiagram": "北斗星，天神执剑，一官人烧香拜，一猴，一兔，一犬。\n羝羊触藩之课 先曲后顺之",
    "explanation": "【卦象描述】雷天大壮䷡ 此卦局也常见不鲜，吾人须知何局为大壮局，如何利用大壮局，何时可用大壮为最利。何时须离开此局。 \n一、性刚为一家之主，有越居父位之象。 \n二、家庭责任感重。 \n三、不婚，与同时生人不同。 \n四、如有婚，必为猴，兔，犬三肖属之人，但常不足三月婚 破。 \n五、事业独立自主，自由业人可为一方之主，声名远播。\n\n【命理解析】雷天大壮䷡2313100\n先天卦：猴、羊、犬成格，长男更状。女不成招凶，过刚。逢凶不为凶，名扬四海。文武双全。官比父大。九重禄命，位至三公。\n后天卦：中年后，平步青云。给看八字：争时宜远，合时宜近。一念之间，天地反复。猴、羊、犬，加贵。\n流年卦：受天子禄命，得人心却背利（被利用）。贵人来助，得快利财，逢猴、羊、犬，加吉。官人升迁，求之不得。妻重病无灾，有解。\n\n【卦占卜故事】雷天大壮䷡此卦唐玄宗避安禄山乱，卜得之，乃知不久 亨通也。\n\n【卦象图解】图中：北斗星，天神执剑，一官人烧香拜，一猴，一兔，一犬。\n羝羊触藩之课 先曲后顺之\n\n【卦图象解】一、北斗星：帝君，老板，主事之人。 \n二、天神执剑：民意归向，人心也。 \n三、一官人烧香拜：拜求于天，而不求人，凶。 \n四、一猴、一兔、一犬：侯，刘，狄姓，在野之人。 \n五、猴回头：回吼。 \n六、兔回头：回吐。 \n七、羊回头：回阳。 此卦示意过刚必招凶，而猴、羊、兔为三贵人，和中近易为处之道。"
  },
  {
    "id": 35,
    "name": "火地晋",
    "hexagramSymbol": "䷢",
    "yaos": [
      "阴",
      "阴",
      "阴",
      "阳",
      "阴",
      "阳"
    ],
    "yaoci": [
      "初六：晋如摧如，贞吉，罔孚，裕无咎。",
      "六二：晋如愁如，贞吉。",
      "六三：众众众众允，悔亡。",
      "九四：晋如鼫鼫鼫鼫鼠，贞厉。",
      "六五：悔亡，失得勿恤，往吉，无不利。",
      "上九：晋其角，维用伐邑，厉吉，无咎，贞咎。"
    ],
    "divinationDiagramName": "火地晋象解",
    "divinationDiagram": "文字破，官人掩面，球在泥上，鸡啣秤，枯木生花，鹿啣书，一堆金宝。\n龙剑入匣之课 以臣遇君之",
    "explanation": "【卦象描述】火地晋䷢ 此局之现，读者可以立判出。 \n一、性柔有母爱之人。 \n二、婚姻常晚，约四十岁以后。 \n三、守财不花，性极节省之人。 \n四、偏房之人，同时生人有婚为正房。 \n五、婚嫁对象若肖鸡，则大吉，但大年长多多。\n\n【命理解析】火地晋䷢2320030\n先天卦：流浪在外，无家可归。父不全母散。切记赌不兴家，唯酉人称心如意。其他（生肖）官事阻。反求于下，中年以后大吉。富贵催人老。后天卦：婚凶，手下犯上（手下包括子女）。三度梅开。逢鸡必成，从商大吉。（鸡、肖鸡，鸡年、长的象鸡）不必留连官府。\n流年卦：婚事凶。升迁无望。失权位，求手下。恰逢酉年或鸡人，必可称心如意。财禄大进。\n\n【卦占卜故事】火地晋䷢此卦昔司马进策，卜得之，后果为丞相。\n\n【卦象图解】图中：文字破，官人掩面，球在泥上，鸡啣秤，枯木生花，鹿啣书，一堆金宝。\n龙剑入匣之课 以臣遇君之\n\n【卦图象解】一、文字破：官事不成，退位象。 \n二、官人掩面：无颜见人，悲象。 \n三、球在泥上：所求必陷险也。 \n四、鸡啣秤：鸡，酉也，肖鸡人也，落日之象。秤：示公平，称心也。 \n五、枯木生花：晚发也。 \n六、鹿啣书：禄与命到也。 \n七、一堆金宝：财禄丰收之象，占疾厄，则有焚金纸之象。主丧服，二人去一也。 \n八、人立水边：恐泣之象，主丧服。 \n九、三点在石上：心象，示人心在石上，不动念，坚心也。"
  },
  {
    "id": 36,
    "name": "地火明夷",
    "hexagramSymbol": "䷣",
    "yaos": [
      "阳",
      "阴",
      "阳",
      "阴",
      "阴",
      "阴"
    ],
    "yaoci": [
      "初九：明夷于飞，垂其翼。",
      "六二：明夷，夷于左股，用拯马壮，吉。",
      "九三：明夷于南狩，得其大首，不可疾贞。",
      "六四：入于左腹，获明夷之心，于出门庭。",
      "六五：箕子之明夷，利贞。",
      "上六：不明晦，初登于天，后入于地。"
    ],
    "divinationDiagramName": "地火明夷象解",
    "divinationDiagram": "妇人在井中，虎在井上钱破人逐鹿，堠上有工尺，珠聚。\n凤凰重翼之课 出明入暗之",
    "explanation": "【卦象描述】地火明夷䷣ 此卦很凶，宅局逢之，必主母先亡，且生前血光连年，希读者 遇之必力求其变局，功德无量，人不知其功，乃所谓阴德也。 \n一、妻生隐疾不好告人。 \n二、破财且诸事不顺。 \n三、易受小人言，招人暗害。\n四、一旦见血光，必终致凶。 \n五、唯肖虎人，可平安渡过。\n\n【命理解析】地火明夷䷣2320524\n先天卦：父不全母全，生逢家业破落时。又逢寅，雪上加霜，母凶。申猴有回禄（回禄指火灾）。破财又损人。｛倪注：以紫微斗数为主，八字为辅。｝回天乏力，大限数终寅。有颈之戒（如吊死、淋巴癌等）。\n后天卦：无力回天，人财都损，妻先招凶。慎防虎人，回禄之灾。守成正财，为人工作，谨言慎行方可无忧。\n流年卦：大限数已终，不逢血光也有火厄。\n｛倪注：山、医、命、相、卜。制度天火同人就可解决。天命1/3<人间道1/3+地脉道/13｝\n\n【卦占卜故事】地火明夷䷣此卦是文王囚姜里，见子不至，卜得知，果 子殁也。\n\n【卦象图解】图中：妇人在井中，虎在井上钱破人逐鹿，堠上有工尺，珠聚。\n凤凰重翼之课 出明入暗之\n\n【卦图象解】一、妇人在井中：女人招灾，或颈部灾，家内有灾。 \n二、虎在外：外人虎视眈眈。 \n三、钱缺：财伤也。 \n四、人逐鹿：财失也，争相为禄，逐鹿中原。 \n五、堠在人鹿中：猴作梗也。 \n六、「：尺也，工匠独有，匠，将也，武官人。 \n七、堠：不动也，尊位也，姓侯，肖猴。 \n八、鹿回头：回禄也，火灾。 \n九、人手上木枝：休象。 见此课，必伤且凶矣。\n\n【卦义解读】外又可远祸患。易之妙即在此，卦之德本亦卦之解也。 利艰贞，晦其明也，内难而能正其志.箕子以之。 处艰难时，能知晦藏其明，不知藏晦，必生祸患，不能守正，必非贤人。 象曰：明入地中，明夷，君子以莅众，用晦而明。 君子观明入地中，明夷之道，乃知不极其明察而用晦之道，于莅众之时，如此必能容物和 众，众亲而安，犹水至清则无鱼，人至明则无徒亦然。"
  },
  {
    "id": 37,
    "name": "风火家人",
    "hexagramSymbol": "䷤",
    "yaos": [
      "阳",
      "阴",
      "阳",
      "阴",
      "阳",
      "阳"
    ],
    "yaoci": [
      "初九：闲有家，悔亡。",
      "六二：无攸遂，在中馈，贞吉。",
      "九三：家人嗃嗃嗃嗃嗃嗃嗃嗃，悔厉吉，妇子嘻嘻，终吝。",
      "六四：富家，大吉。",
      "九五：王假有家，勿恤，吉。",
      "上九：有孚威如，终吉。"
    ],
    "divinationDiagramName": "风火家人象解",
    "divinationDiagram": "一人张弓，一带在水边，云中文书， 贵人拜绶，妇人携手。三点。\n入海求珠之课 开花结子之",
    "explanation": "【卦象描述】风火家人䷤ 今日常见之卦局，读者可知如后： \n一、 从官职必无法升职。 \n二、 科甲功名无虑。 \n三、 婚延后五年与同时生人不同。 \n四、 与家人相处和睦，且非常顾家。 \n五、 多妇人病。\n\n【命理解析】风火家人䷤2321820\n先天卦：家和睦，事业兴，田财广进。科甲高中，生而为官，妻妾各一。兄弟一文一武。严母持家。\n后天卦：由武转文，受封印，先有阻滞，事后成。妻助力大，唯逢水年凶。婚事吉，得二子。\n流年卦：逢之有科甲，官人受印。大贵之年，婚必成。恰逢水年防人生暗害。\n{倪注：害你的人，都是暗中陷害你。}\n\n\n【卦占卜故事】风火家人䷤此卦董永丧父卖身，卜之。\n\n【卦象图解】图中：一人张弓，一带在水边，云中文书， 贵人拜绶，妇人携手。三点。\n入海求珠之课 开花结子之\n\n【卦图象解】一、一人张弓：暗算，破坏也。 \n二、一带在水边：事滞也，弃官也。 \n三、云中文书：突而来之喜讯也。 \n四、贵人拜受：绶命也。 \n五、妇人携手：家和之象，此卦卜婚姻大吉。"
  },
  {
    "id": 38,
    "name": "火泽睽",
    "hexagramSymbol": "䷥",
    "yaos": [
      "阳",
      "阳",
      "阴",
      "阳",
      "阴",
      "阳"
    ],
    "yaoci": [
      "初九：悔亡，丧马勿逐，自复；见恶人，无咎。",
      "九二：遇主于巷，无咎。",
      "六三：见舆曳，其牛掣，其人天且劓，无初有终。",
      "九四：睽孤，遇元夫，交孚，厉无咎。",
      "六五：悔亡，厥宗噬肤，往何咎。",
      "上九：暌孤，见豕负涂，载鬼一车，先张之弧，后说之弧，匪寇婚媾，往遇雨则吉。"
    ],
    "divinationDiagramName": "火泽睽象解",
    "divinationDiagram": "人执斧在手，文书半破，牛鼠，桃开斗 掩，雁飞鸣。\n猛虎陷井之课 二女同舟之",
    "explanation": "【卦象描述】火泽睽䷥ 我们常见有小女孩，背离家人，自顾自私，使父母深为苦恼， 而无法改变，只有任其任性而为，终致一生皆凶，坎坷，实因自内 生。 \n一、性刚僻倔强，任性胡闹，以致家无法容。 \n二、肖牛肖鼠人见之，更凶。 \n三、科甲不兴。 \n四、婚姻不成。 \n五、招凶事，官司，灾祸连连。 \n六、有同性恋倾向。\n\n【命理解析】火泽睽䷥2322250\n先天卦：生逢家道衰，父母不和，有牢灾。与母无缘。求财不择手段，逢鼠逢牛避之吉。｛倪注：逢此卦要正话反说，方能说服当事人从善。｝\n后天卦：一事无成，家人背离，牢狱之灾。唯鼠牛人可避，其余生肖多凶，南迁吉。\n流年卦：侥倖得财，逢鼠牛主破。婚破事破，不逃入牢门。南迁吉。今年遇刚强之贼（由偷变抢或杀人）。｛倪注：读“门”，问父母，日有余而月不足也。｝\n\n【卦占卜故事】火泽睽䷥此卦武则天聘尚贾至精魅成，卜此除之。\n\n【卦象图解】图中：人执斧在手，文书半破，牛鼠，桃开斗 掩，雁飞鸣。\n猛虎陷井之课 二女同舟之\n\n【卦图象解】一、人执斧在手：求快也，行刑之人，执法之人，有权柄也。 \n二、文书半破：无望象，毁约也。 \n三、牛鼠：秋冬吉，春夏凶。 \n四、桃开：逃开也。 \n五、门掩：牢狱之灾，闭也，隔也。\n六、雁飞鸣：悲也，孤单也，报凶讯也。\n\n【卦义解读】睽，以卦才言火在"
  },
  {
    "id": 39,
    "name": "水山蹇",
    "hexagramSymbol": "䷦",
    "yaos": [
      "阴",
      "阴",
      "阳",
      "阴",
      "阳",
      "阴"
    ],
    "yaoci": [
      "初六：往蹇，来誉。",
      "六二：王臣蹇蹇，匪躬之故。",
      "九三：往蹇，来反。",
      "六四：往蹇，来连。",
      "九五：大蹇，朋来。",
      "上六：往蹇，来硕，吉，利见大人。"
    ],
    "divinationDiagramName": "水山蹇象解",
    "divinationDiagram": "日当天，旗一面上有使字鼓五面中有 一鹿、堠上千里字。 一鹿、堠上千里字。\n飞雁啣草之课 背明向暗之",
    "explanation": "【卦象描述】水山蹇䷦ 此局利从武官之人，如军人、警察、外交、司法人员等，也可 以刻意布出此局如果你想儿子从此类公职的话。 \n一、求财亨通，且无功利之心。 \n二、官调他乡，与六亲远离。 \n三、婚姻较同时生人延后七年。 \n四、科甲吉，故考试资格必顺心。 \n五、独自发展亦特立独行也。\n\n【命理解析】水山蹇䷦2323000\n先天卦：生于官家，日头正旺。两人一大口，六亲数在五人。但出一卜，一商人。外地封侯，一方之主。不为使节，为儒林。\n后天卦：夫妻同出外地，五人相从。夫来从官，妻生财。三子去一，发二房（二儿子）。女命逢之，千里单骑，出外求财，岛中居。\n流年卦：夫当外出，求禄必兴。官人逢之，出外使节。女命逢之，须防子劫（儿子被偷或招情劫等）。偷天换日。\n\n【卦占卜故事】水山蹇䷦此卦锺离末将收楚，卜得之，乃知身不王矣。\n\n【卦象图解】图中：日当天，旗一面上有使字鼓五面中有 一鹿、堠上千里字。 一鹿、堠上千里字。\n飞雁啣草之课 背明向暗之\n\n【卦图象解】一、日当天：君明之象，吴姓。 \n二、旗一面只有使字：出使，和平之象，使—二人一口，示单人也。 \n三、鼓五面者：时为五更天，占五面地，王为君王，一方之主，有多国或多岛之象。 \n四、中有一鹿：携财福至，旅客带财来状，商人至也。 五、堆子千里字：行西南，千里封候，候姓也。 \n六、千里为重：有第二次方吉。\n\n【卦义解读】以刚居下卦之"
  },
  {
    "id": 40,
    "name": "雷水解",
    "hexagramSymbol": "䷧",
    "yaos": [
      "阴",
      "阳",
      "阴",
      "阳",
      "阴",
      "阴"
    ],
    "yaoci": [
      "初六：无咎。",
      "九二：田获三狐，得黄矢，贞吉。",
      "六三：负且乘，致寇至，贞吝。",
      "九四：解而姆，朋至斯孚。",
      "六五：君子维有解，吉，有孚于小人。",
      "上六：公用射隼于高墉之上，获之无不利。"
    ],
    "divinationDiagramName": "雷水解象解",
    "divinationDiagram": "旗上提字，一刀插地，一兔走，贵 人云中，一鸡在边鸣，道士手指门，道 人献书，小堠在侧。\n雷行风止之课 患难",
    "explanation": "【卦象描述】雷水解䷧ 此卦局常见，也相当特殊： \n一、为性刚武勇之人。 \n二、总是官司是非不断。 \n三、无婚。 \n四、肖兔人，刘姓人，柳姓人，主凶。 \n五、出家为唯一可解之人事手段。\n\n【命理解析】雷水解䷧2323530\n先天卦：生于患难，后平安。逢兔而走，失一兄。弃武从文，数中定。逢鸡则主入空门。正官带印，卯金一刀人，大吉（刘姓）。\n后天卦：大志消磨，日沉沉。难舍众生一兔人。逢鸡有机展长才。日在床头不须虑。\n流年卦：是非之年，兔人一刀走他乡，身在逆旅。不意逢鸡反得利，日出山头。（酉鸡，九月时）\n\n【卦占卜故事】雷水解䷧此卦项羽受困垓下，卜得之，后果士卒溃散也。\n\n【卦象图解】图中：旗上提字，一刀插地，一兔走，贵 人云中，一鸡在边鸣，道士手指门，道 人献书，小堠在侧。\n雷行风止之课 患难\n\n【卦图象解】一、旗上提字：指名提凶，不利。有远走他乡之象。 \n二、一刀插地：求快也，刘姓之人也。 \n三、一兔走：卯年，刘姓。 \n四、一鸡在边鸣：有竞争象，酉年适逢贵人救。 \n五、贵人云中：不及救也。 \n六、道士手指门：入空门也，逃亡方向，出家也。 \n七、道人献书：装饰外表，示诚象。"
  },
  {
    "id": 41,
    "name": "山泽损",
    "hexagramSymbol": "䷨",
    "yaos": [
      "阳",
      "阳",
      "阴",
      "阴",
      "阴",
      "阳"
    ],
    "yaoci": [
      "初九：已事遄往，无咎，酌损之。",
      "九二：利贞，征凶，弗损益之。",
      "六三：三人行，则损一人。",
      "六四：换其疾，使遄有喜，无咎。",
      "六五：或益之，十朋之龟，弗克违，元吉。",
      "上九：弗损益之，无咎，贞吉，利有攸往，得臣无家。"
    ],
    "divinationDiagramName": "山泽损象解",
    "divinationDiagram": "二人对酌，酒瓶倒案上，球在地上， 文书二策，有再告二字。\n凿石见玉之课 握土爲山之",
    "explanation": "【卦象描述】山泽损䷨ 损局在阳宅上造成儿子问题多多，父母总是烦心担忧。 \n一、与同时生人，婚事延后一年方成，对方同一人。 \n二、官运不通，所求不成。 \n三、性喜求乐，不求进步，须经二次大灾，方能悟。\n四、对家庭态度，只会花钱，不会赚钱，无所事事。\n\n【命理解析】山泽损䷨2330230\n先天卦：三人损一人，攀龙附凤求功名。始成终破为定数。举人终身，一身平安。父不父，子不子，中间有个不完妻。\n后天卦：明月当空，清闲度日。遇事力求反失，再次求可成。\n流年卦：二人同力，所求初不成，再次吉。官事不升，财禄不求反吉。\n\n【卦占卜故事】山泽损䷨此卦薛仁贵将收燕，卜得之，大破燕军。\n\n【卦象图解】图中：二人对酌，酒瓶倒案上，球在地上， 文书二策，有再告二字。\n凿石见玉之课 握土爲山之\n\n【卦图象解】一、二人对酌：二人夹木，来也。 \n二、酒瓶倒案之：目前无指望也。 \n三、球在地上：所求不成状。 \n四、文书二策有再告二字：再次求，方成。 居此之时唯求有益于人，乃得损之真道也，损其多余，同志乃至。"
  },
  {
    "id": 42,
    "name": "风雷益",
    "hexagramSymbol": "䷩",
    "yaos": [
      "阳",
      "阴",
      "阴",
      "阴",
      "阳",
      "阳"
    ],
    "yaoci": [
      "初九：利用爲大作，元吉，无咎。",
      "六二：或益之，十朋之龟，弗克违，永贞吉，王用享于帝，吉。",
      "六三：益之用凶事，无咎。",
      "六四：中行，告公从，利用爲依迁国。",
      "九五：有孚惠心，勿问元吉，有孚惠我德。",
      "上九：莫益之，或击之，立心勿恒，凶。"
    ],
    "divinationDiagramName": "风雷益象解",
    "divinationDiagram": "官人抱合子，一人推车，一鹿一钱。\n鸿鹄遇风之课 河水溢出之",
    "explanation": "【卦象描述】风雷益䷩ \n一、长女之婚事不成，或成后又破。 \n二、财禄足，有祖业，工作则又过于男性。\n三、女身男性，贵人为男人，小人为女子。 \n四、从官运则吉，切不可贪禄，主凶。\n\n【命理解析】风雷益䷩2330330\n先天卦：才禄俱备，生在富门。承继祖业，发扬光大。数中单传，有弟须防。寿如松柏。\n后天卦：运至时行，无往不利。逢官从破，求才大利。似凶还吉，夫妻平安。\n流年卦：时来运转，求财求官皆得。逢赌反凶，可进不可退，退凶。防火厄，防窃。\n\n【卦占卜故事】风雷益䷩此卦冉伯牛有疾，卜得之，乃知谩师之过也。\n\n【卦象图解】图中：官人抱合子，一人推车，一鹿一钱。\n鸿鹄遇风之课 河水溢出之\n\n【卦图象解】一、官人抱合子：倌人，丈夫也，事必先成后破。 \n二、一人推车：因时而动之象，空坐相请。 \n三、一鹿一钱：才禄俱备，有回禄之灾，财有破损，忧心忡忡。 \n四、不为财货，不畏时尚之变，明知先成后破，仍走马上任，以损上益下之道，天下或事 业亦能平治。"
  },
  {
    "id": 43,
    "name": "泽天夬",
    "hexagramSymbol": "䷪",
    "yaos": [
      "阳",
      "阳",
      "阳",
      "阳",
      "阳",
      "阴"
    ],
    "yaoci": [
      "初九：壮于前趾，往不胜爲咎。",
      "九二：惕号，莫夜有戎，勿恤。",
      "九三：壮于頄頄頄頄，有凶。",
      "九四：臀无肤，其行次且，牵羊悔亡，闻言不信。",
      "九五：苋陆夬夬夬夬夬夬夬夬，中行无咎。",
      "上六：无号，终有凶。"
    ],
    "divinationDiagramName": "泽天夬象解",
    "divinationDiagram": "二人同行，前水后火，虎蛇当道，一 人斩蛇，竿上有文字，竿下有钱。\n神剑斩蛟之课 先损后益之",
    "explanation": "【卦象描述】泽天夬[guài]䷪ \n一、婚事延宕不成。 \n二、性刚从武，性柔从宗教，吾人可从八字中看出。 \n三、事业先主凶后吉，主自行发展。 \n四、科甲不兴。 \n五、身体健康差，不长寿，三十岁前有凶险。\n\n【命理解析】泽天夬[guài]䷪2330900\n先天卦：一生辛苦，白手成家。求科甲吉，求财利少。女命为师道，终身可吉，男为武吉。求官求富，招害难免。婚事难成，逢虎刚断乃亨。\n后天卦：逢土金之年，前险后阻。求财不利，只发武将。遇虎大贵，逢凶化吉。夫妻相助，无子相继。\n流年卦：婚事易成，外圆内方。天地交泰。财气欠旺，得利二、三分。家有丧服。\n\n【卦占卜故事】泽天夬[guài]䷪此卦汉高祖欲拜韩信为将，卜得之，知有王 佐才也。\n\n【卦象图解】图中：二人同行，前水后火，虎蛇当道，一 人斩蛇，竿上有文字，竿下有钱。\n神剑斩蛟之课 先损后益之\n\n【卦图象解】一、二人同行：相辅相成，可成事也。 \n二、前水后火：前险而后明，宜进取象，土生金象。 \n三、虎蛇当道：虎，有权威之人。蛇—险奸之小人阻道。 \n四、一人斩蛇：勇士也，得名将也。 \n五、竿上有文字：扬竿而起，正名出师。 \n六、竿下有钱：行动有利也。 \n七、钱下有火：烧钱状，主丧服。"
  },
  {
    "id": 44,
    "name": "天风姤",
    "hexagramSymbol": "䷫",
    "yaos": [
      "阴",
      "阳",
      "阳",
      "阳",
      "阳",
      "阳"
    ],
    "yaoci": [
      "初六：系于金柅柅柅柅，贞吉，有攸往，见凶，羸豕孚蹢蹢蹢蹢躅。",
      "九二：包有鱼，无咎，不利宾。",
      "九三：臀无肤，其行次且，厉，无大咎。",
      "九四：包无鱼，起凶。",
      "九五：以杞包瓜，含章，有损自天。",
      "上九：姤姤姤姤其角，吝，无咎。"
    ],
    "divinationDiagramName": "天风姤象解",
    "divinationDiagram": "官人射鹿，文书有喜字，二人执索，绿衣人指路。\n风云相济之课 或聚或散之",
    "explanation": "【卦象描述】天风姤䷫ 吾人常见丈夫在外风流多事，桃花运不断，就是此局生成。 \n一、 商人财禄丰盛，只旺六年，须注意假象。 \n二、 官司受牵连，同时生人可能没事。 \n三、 外有妾及多位女友。 \n四、 夫妻失和，如命中属二婚命，则必破。 \n五、 官家人亦吉前六年，第七年以后必凶。\n\n【命理解析】天风姤䷫2331340\n先天卦：外柔内刚，男主一妻又一妻，女主一夫又一夫。身短才高，财官双美，唯婚姻如线（易断）。数中四人，一外二官，一有凶。\n后天卦：终身忙碌，（夫妻）同床异梦。侥倖得财，却防官累。合伙有事，不宜。\n流年卦：主得意外之财，婚事易成。完全侥倖，出行大利。大头贵人，小头事凶。科甲吉。\n\n【卦占卜故事】天风姤䷫此卦汉吕后拟立吕氏谋汉社稷，卜得之果 不利也。\n\n【卦象图解】图中：官人射鹿，文书有喜字，二人执索，绿衣人指路。\n风云相济之课 或聚或散之\n\n【卦图象解】一、官人射鹿：丈夫也，取禄状，野外之财，射，发也。 \n二、文书上有喜字：摇摇欲坠，根只一线，夫妻凶。 \n三、二人执索：互相牵累。 \n四、绿衣人指路：掌生死簿之人，信差（今日） 。 \n五、二重山：重阻也。出也。\n\n【卦义解读】于初而将长盛之卦，小人之道，于始"
  },
  {
    "id": 45,
    "name": "泽地萃",
    "hexagramSymbol": "䷬",
    "yaos": [
      "阴",
      "阴",
      "阴",
      "阳",
      "阳",
      "阴"
    ],
    "yaoci": [
      "初六：有孚不终，乃乱乃萃，若号，一握爲笑，勿恤，往无咎。",
      "六二：引吉，无咎，孚乃利用禴禴禴禴。",
      "六三：萃如磋如，无攸利，往无咎，小吝。",
      "九四：大吉无咎。",
      "九五：萃有位，无咎。",
      "上六：赍赍赍赍咨涕洟洟洟洟，无咎。"
    ],
    "divinationDiagramName": "泽地萃象解",
    "divinationDiagram": "贵人磨玉， 一僧指小儿山路，一人救火，一鱼在火上，一凤啣书。\n鱼龙会聚之课 如水就下之",
    "explanation": "【卦象描述】泽地萃䷬ 较不多见，但亦有之。 \n一、女儿不想成婚，对异性没兴趣。 \n二、终日进德修业。 \n三、退居家内，代母行职，为良母型之人。 \n四、如从事餐饮业则大利，为唯一带喜之路。\n\n【命理解析】泽地萃䷬2331700\n先天卦：石中有玉，又遇名师，一子内人，一子外人。平步青云，灾难平，科甲顺。多才艺，救人事业，始终如一。发光头，曾人（曾姓），鱼下日（鲁姓）。玉在其中。\n后天卦：中年成就，禄命九重来。本待退隐，天不由人，丰厚时。一僧一尼，逢贯鱼，功成名就。\n流年卦：进德修业，耐心等待必吉。求科高中，创新事业。\n\n【卦占卜故事】泽地萃䷬此卦韩信被吕后疑惑，卜得知，果被其戮 也。\n\n【卦象图解】图中：贵人磨玉， 一僧指小儿山路，一人救火，一鱼在火上，一凤啣书。\n鱼龙会聚之课 如水就下之\n\n【卦图象解】一、贵人磨玉：进修也，专心一致也，免破损也。 \n二、一僧指：指引也，局外人也，光头人也，曾姓人也。 \n三、小儿山路：退引山林，以退为进象，示上坡也。倪姓。 \n四、一人救火：救灾祸也；犹行医济世救人之道也。 \n五、一鱼在火上：得救状，或餐饮业。 \n六、一凤啣书：喜讯至也。\n\n【卦义解读】萃卦，乃"
  },
  {
    "id": 46,
    "name": "地风升",
    "hexagramSymbol": "䷭",
    "yaos": [
      "阴",
      "阳",
      "阳",
      "阴",
      "阴",
      "阴"
    ],
    "yaoci": [
      "初六：允升，大吉。",
      "九二：孚乃利用禴禴禴禴，无咎。",
      "九三：升虚邑。",
      "六四：王用享于岐山，吉，无咎。",
      "六五：贞，吉，升阶。",
      "上六：冥升，利于不息之贞。"
    ],
    "divinationDiagramName": "地风升象解",
    "divinationDiagram": "云中雨点下，木匠下墨",
    "explanation": "【卦象描述】地风升䷭ 其为姤卦之对应卦，在地脉道之屡见不鲜，学者当已娴熟于卦 局之变化，立可知晓。 \n一、官职大利，平步青云。 \n二、事业财禄丰盛。 \n三、能承继祖业，更新门面。 \n四、夫妻有竞争，不和之象。 \n五、此局不变，婚姻进入第七年必有凶，同时生人不一定会发 生，故阳宅影响一人至大，而人们却茫然不知。\n\n【命理解析】地风升䷭2332200\n先天卦：久旱逢雨，光宗耀祖。六人兄弟，四明二暗。任重道远之才，改朝换代（才高八斗）。逢木有事，不费规矩，逢凶也吉。｛倪注：木，李、宋、人瘦、脸青色等｝\n后天卦：官暗将过，出雨木子人。逢金相克，改朝换代。夫妻兴家，有规有矩。\n流年卦:鲁班门中，喜得麟儿。雨过天青，兴家有旺。坚心向道，终必吉果。婚事吉，得女主贵。\n\n\n【卦占卜故事】地风升䷭此卦房玄龄去蓬莱采葯未回，卜得知，主不 在也。\n\n【卦象图解】图中：云中雨点下，木匠下墨\n\n【卦图象解】一、云中雨点下：沾衣恩泽之象，昏暗之时将过也。 \n二、木匠下墨解木：有尺度法则，有依据之象。匠—将也。以武力去灾也有改朝换代之象 也。 \n三、一人磨镜：可成始得之象。 \n四、一架子负大木：有不小之财也。 \n五、有镜：指明镜高悬，于商事指有竞争也。\n六、蓝：难也，百废待与之象。"
  },
  {
    "id": 47,
    "name": "泽水困",
    "hexagramSymbol": "䷮",
    "yaos": [
      "阴",
      "阳",
      "阴",
      "阳",
      "阳",
      "阴"
    ],
    "yaoci": [
      "初六：臀困于株木，入于幽谷，三岁不觌。",
      "九二：困于酒食，朱绂方来，利用享祀：征凶，无咎。",
      "六三：困于石，据于蒺藜，入于其宫，不见其妻，凶。",
      "九四：来徐徐，困于金车，吝，有终。",
      "九五：劓刖，困于赤绂，乃徐有说，利用祭祀。",
      "上六：困于葛藟藟藟藟，于臲卼臲卼臲卼臲卼，曰动悔。"
    ],
    "divinationDiagramName": "泽水困象解",
    "divinationDiagram": "一轮独在地上，一人卧病，葯炉，贵人倾水救旱池鱼，池中青草。\n河中无水之课 守己待时之",
    "explanation": "【卦象描述】泽水困䷮ 困之于人大矣，吾道人士能为众生解开此局，亦无量功德也。 \n一、体弱多病，限不过三十岁。 \n二、性刚烈，独行独断。 \n三、婚事不成，多有阻滞。\n四、财禄不守，只有一线生机，故从商必凶。 解之唯大过可也。\n\n【命理解析】泽水困䷮2332710\n先天卦：父全母不全，病重。势单力薄，求救无门。巧业安身（如修表），有志不成。逢水主大贵人助。\n后天卦：鳏居之人，一人卧病。独行无依，犹有生气。不生贪念，正财到老平安。\n流年卦：行不得也，家人有灾。事乃招困，婚事不成。不贪不求，唯悦可解。\n｛倪注：折字须把字当图来看，因为先有象后才有字。｝\n\n【卦占卜故事】泽水困䷮此卦李德裕罢相时，卜得之，乃知身命无 气也。\n\n【卦象图解】图中：一轮独在地上，一人卧病，葯炉，贵人倾水救旱池鱼，池中青草。\n河中无水之课 守己待时之\n\n【卦图象解】一、一轮独在地下：独行也无依也，方向不明也。 \n二、一人卧病，招危难也。 \n三、药炉：有人来救，待时缓进也。 \n四、贵人倾水救旱池鱼：旱池，无财也，有贵人资援。 \n五、池中青草：仍有生气状。"
  },
  {
    "id": 48,
    "name": "水风井",
    "hexagramSymbol": "䷯",
    "yaos": [
      "阴",
      "阳",
      "阳",
      "阴",
      "阳",
      "阴"
    ],
    "yaoci": [
      "初六：井泥不食，旧井无禽。",
      "九二：井谷射鲋，瓮敝漏。",
      "九三：井渫不食，爲我心恻，可用汲，王明并受其福。",
      "六四：井甃，无咎。",
      "九五：井洌，寒泉食。",
      "上六：井收勿幕，有孚元吉。"
    ],
    "divinationDiagramName": "水风井象解",
    "divinationDiagram": "金甲神执符，女子抱合，钱宝有光起，人落井中，官人用绳引出。\n珠藏深渊之课 守静安常之",
    "explanation": "【卦象描述】水风井䷯ \n一、婚事娶二婚妻，且妻长。 \n二、心志不坚，受外在诱惑，无法自拔。 \n三、从商吉，有祖业更吉。 \n四、从官招陷，是非不断，升迁受阻。\n\n【命理解析】水风井䷯2410030\n先天卦：四十有八头九口，大限不出四十。财来财去，唯有官是贵。逢申总是凶，逢女则吉。（女此卦吉）\n后天卦：安身勿动，守道无亏。井颈之戒（颈病），诸事不顺。逢申大凶，大限数终。（over）夫留妻不留。\n流年卦：病危之时，即有贵人助，傍人作对。丧事不久，先成后破，有财不失。大限数终。（大限到了）\n\n【卦占卜故事】水风井䷯此卦杨贵妃，私与安禄山为事，卜得之，反 受其害也。\n\n【卦象图解】图中：金甲神执符，女子抱合，钱宝有光起，人落井中，官人用绳引出。\n珠藏深渊之课 守静安常之\n\n【卦图象解】一、金甲神执符：贵人在空中，祥瑞之兆也。 \n二、女子抱合：好也，但先成后破。 \n三、钱宝有光起：财不失，不露之象，不久有丧也。 \n四、人落井中：病重象，官司沈陷象，招陷害也。 \n五、官人用绳引出：贵人为官人，欲相救也。 \n六、符：符乃策略有傍人作对。\n\n【卦义解读】能以至善而居卦终，乃大成也。"
  },
  {
    "id": 49,
    "name": "泽火革",
    "hexagramSymbol": "䷰",
    "yaos": [
      "阳",
      "阴",
      "阳",
      "阳",
      "阳",
      "阴"
    ],
    "yaoci": [
      "初九：巩用黄牛之革。",
      "六二：巳日乃革之，征吉，无咎。",
      "九三：征凶，贞厉。",
      "九四：悔亡，有孚，改命，吉。",
      "九五：大人虎变，未占有孚。",
      "上六：君子豹变，小人革面，征凶，居贞吉。"
    ],
    "divinationDiagramName": "泽火革象解",
    "divinationDiagram": "一人把柿全，一人把柿不全，一兔虎，官人推车，车上一印，在大路上。\n豹变爲虎之课 改旧从新之",
    "explanation": "【卦象描述】泽火革䷰ \n一、 此女天生刚勇，且明事理。 \n二、 感情困扰多。 \n三、 婚姻比同时生人早二年，且比姊早婚。\n四、官运享通，经商不利。（视频）\n五、科甲，吉。（视频）\n\n【命理解析】泽火革䷰2410505\n先天卦：兄弟二人，发一人，一人不全。百里侯（县长），得印信，不可黑心为己。｛倪注：腾蛇纹入口，饿死｝逢虎逢兔堪大任。再上一层赖其功。\n后天卦：努力有成晚得印。逢虎贵人助更吉，运转四方随心志。夫妻吉。\n流年卦:升职外调掌权年。逢虎逢兔为贵人。求财不利，利求官。守在一方，等待时机。\n\n【卦占卜故事】泽火革䷰此卦彭越战项王絶粮时，卜得之，遂能承恩 改革也。\n\n【卦象图解】图中：一人把柿全，一人把柿不全，一兔虎，官人推车，车上一印，在大路上。\n豹变爲虎之课 改旧从新之\n\n【卦图象解】一、一人把柿全，乃人肺腑之言。 \n二、一人把柿不全，一人半真言也。 \n三、一兔：跃进之象。 \n四、一虎：威权之象，大人之象，肖虎也。 \n五、官人推车有一印：如为武官，则讼至。今为文官带印，主得挂印封帅，须力求变革， 果必成。丈夫推车，乃求婚也，带印必成。 \n六、虎兔向山行：贤良大人退，后继有人跃进同行。 \n七、山头四点：上位之人，黑暗不明之象。 \n八、大路：转变为新且顺之象。\n\n【卦义解读】九三相位，居下卦之"
  },
  {
    "id": 50,
    "name": "火风鼎",
    "hexagramSymbol": "䷱",
    "yaos": [
      "阴",
      "阳",
      "阳",
      "阳",
      "阴",
      "阳"
    ],
    "yaoci": [
      "初六：鼎顚趾，利出否。",
      "九二：鼎有实，我仇有疾，不我能即，吉。",
      "九三：鼎耳革，其行塞，雉膏不食，方雨亏悔，终吉。",
      "九四：鼎折足，覆公餗餗餗餗，其形渥，凶。",
      "六五：鼎黄耳，金铉，利贞。",
      "上九：鼎玉铉，大吉，无不利。"
    ],
    "divinationDiagramName": "火风鼎象解",
    "divinationDiagram": "云中月现，鹊南飞，一子裹席帽，一人执刀， ，贵人端坐无畏，一鼠。\n调和鼎鼐之课 去故取新之",
    "explanation": "【卦象描述】火风鼎䷱ 此局最利未婚小姐，我常利用此局助人无数。 \n一、 其必嫁贵夫。 \n二、 果决刚断，不易受惑。 \n三、 婚比姊早婚，且冬天方成。 \n四、 官运亨通，财不利。 \n五、 鼠生人凶，不吉。 \n六、 科甲吉，考试顺利。\n\n【命理解析】火风鼎䷱2411100\n先天卦：家世青白，声名显。天生官人不为高，妻无子，妾有子。是非分明，逢鼠招害，向南迁。忌妻为鼠，有凶招灾。\n后天卦：受禄命，为清官。数主生杀。（法官、军人、警察）南行有暗害，逢鼠加凶，退吉。有子无婚数中定。\n流年卦：官人迁南在冬至。侥倖得财招人暗害、妒陷。婚事不成防险，（对方）表里不 一，不利鼠人。\n\n【卦占卜故事】火风鼎䷱此卦秦君卜得之，乃知得九鼎以象九州也。\n\n【卦象图解】图中：云中月现，鹊南飞，一子裹席帽，一人执刀， ，贵人端坐无畏，一鼠。\n调和鼎鼐之课 去故取新之\n\n【卦图象解】一、云中月现：显象，拨云见月之象，清明也。 \n二、鹊南飞：冬至来临，北人执政。 三九一 \n三、一子裹席帽，不明之人，无知之人。果喜也。 \n四、一人执刀：武官也，护卫将军。 \n五、贵人端坐无畏：君王，老板等人，至公无私。 \n六、一鼠：子年，暗谋之人，内有阴谋，肖鼠人也。\n\n【卦义解读】人能如卦才，外明内顺，"
  },
  {
    "id": 51,
    "name": "震为雷",
    "hexagramSymbol": "䷲",
    "yaos": [
      "阳",
      "阳",
      "阴",
      "阳",
      "阴",
      "阴"
    ],
    "yaoci": [
      "初九：震来虩虩虩虩虩虩虩虩，后笑言哑哑，吉。",
      "六二：震来厉，亿丧贝，跻于九陵，勿逐，七日得。",
      "六三：震苏苏，震行无眚。",
      "九四：震遂泥。",
      "六五：震往来厉，亿无丧有事。",
      "上六：震索索，视矍矍，征凶。"
    ],
    "divinationDiagramName": "震为雷象解",
    "divinationDiagram": "人在岩上立，一树开花，一文书，一人推车上有文字，一堆钱财者。\n震惊百里之课 有声无形之",
    "explanation": "【卦象描述】震为雷䷲ 生局之中，此局很特殊，未经吾派之人改，自然居此局中人， 其必天生好手，在家为贵子无疑。 \n一、 有承继祖业，发扬光大之实力。 \n二、 科甲兴旺，名列前茅。 \n三、 官运通顺，只限未婚前。 \n四、 从商亦吉，但须为负责人。 \n五、 婚姻按命中走，红鸾星动之年，即成婚之年。 \n六、 须注意此局只现在婚前，婚后必不见。惟天卦可继续其 运势。\n\n【命理解析】震为雷䷲2411550\n先天卦：生有一口好辩才，长子成格。乡里之间有名声，白手兴家。一朝得禄命，运转四方。不知居安思危，好景不长。\n后天卦：位高不稳，所求必至，忧心不断。求财得财，惜不长久，戒之在盛。\n流年卦：财官双美，逢五带孝，一、四得令（二十一岁、二十四岁、二十五岁）。\n\n【卦占卜故事】震为雷䷲此卦是李静天师遇龙母借宿，替龙行雨， 卜得之，官至仆射。\n\n【卦象图解】图中：人在岩上立，一树开花，一文书，一人推车上有文字，一堆钱财者。\n震惊百里之课 有声无形之\n\n【卦图象解】一、人立岩上：特立独行，摇摇欲坠也。危险也。 \n二、一树开花：有果也，惜乎过于短暂，少部份之人。 \n三、一文书：消息至，公文至。 \n四、一人推车：转变之象，执行命令象。 \n五、上有文字：得官令也。 \n六、一堆钱财者：钱财散于地状，忧心也，丧事也，求财不利，占疾病凶。\n\n【卦义解读】洊为重意，上下同卦故为洊雷，形容威震之大也，君子观之乃知恐惧自修，畏天威省思已 过而改之，唯君子能如是。"
  },
  {
    "id": 52,
    "name": "艮为山",
    "hexagramSymbol": "䷳",
    "yaos": [
      "阴",
      "阴",
      "阳",
      "阴",
      "阴",
      "阳"
    ],
    "yaoci": [
      "初六：艮其趾，无咎，利永贞。",
      "六二：艮其腓，不拯其随，其心不快。",
      "九三：艮其限，列其夤，厉薰心。",
      "六四：艮其身，无咎。",
      "六五：艮其辅，言有序，悔亡。",
      "上九：敦艮，吉。"
    ],
    "divinationDiagramName": "艮为山象解",
    "divinationDiagram": "猴上东北字，猴执文书，官吏执镜，三人绳相系缚\n游鱼避网之课 积小成高之",
    "explanation": "【卦象描述】艮为山䷳ \n一、 科甲顺利，必中理想之学校。 \n二、 健康平安，为孝子。 \n三、 婚姻顺利，进入八字中红鸾星之年必婚。 \n四、 公职大利。 \n五、 知进退，为天生受人喜欢之人。\n\n【命理解析】艮为山䷳2411900\n先天卦：五房兄弟二房贵，数中猴子，三子成格。生猴，逢猴发黄甲，司法人大吉。不入格人，主是非，多讼、多灾，数中定。不贪不求等时机。不为医林为儒林。\n后天卦：官止不进，逢猴封侯。求财从商，官讼连连。申年大忌，不求侥倖，大吉。\n流年卦：猴逢之主大吉。身受禄命，合伙必凶，招人边累。科甲逢之大吉，婚事亦吉。\n\n【卦占卜故事】艮为山䷳此卦是汉高祖困荣阳时，卜得知，只宜守旧。\n\n【卦象图解】图中：猴上东北字，猴执文书，官吏执镜，三人绳相系缚\n游鱼避网之课 积小成高之\n\n【卦图象解】一、堠上东北字：候也，停滞等候也，陈姓。 \n二、猴执文书：候其时，待公文命令至也。 \n三、官吏执镜：清明之法官，政治清明。（视频：如卜商机，镜者竞争也。） \n四、三人绳相系缚：三人相牵连招讼事也。 （三人为众也。）\n\n【卦义解读】艮止之道，其功在能止于适止之所，此唯圣人能成之。此卦"
  },
  {
    "id": 53,
    "name": "风山渐",
    "hexagramSymbol": "䷴",
    "yaos": [
      "阴",
      "阴",
      "阳",
      "阴",
      "阳",
      "阳"
    ],
    "yaoci": [
      "初六：鸿渐于干，小子厉，有言，无咎。",
      "六二：鸿渐于磐，饮食衎衎，吉。",
      "九三：鸿渐于陆，夫征不复，妇孕不育，凶，利御寇。",
      "六四：鸿渐于木，或得其桷，无咎。",
      "九五：鸿渐于陵，妇三妇不孕，终莫之胜，吉。",
      "上九：鸿渐于陆，其羽可用爲仪，吉。"
    ],
    "divinationDiagramName": "风山渐象解",
    "divinationDiagram": "一望竽在爽高处，一药炉在地，一官人登梯， 一枝花在地上。\n高山植木之课 积小成大之",
    "explanation": "【卦象描述】风山渐䷴ \n一、 科甲不顺，缺临门一脚。 \n二、 工作心念不定，常思变动。 \n三、 身体平安，灾少。\n四、对婚姻不采主动，婚事难成。 \n五、 出任公、教职大利。 此局变化多，随时成之故学者须注意。\n\n【命理解析】风山渐䷴2412440\n先天卦：排名第二，科甲高中，二人久分。从医从官两相宜。婚姻短暂。聚少散多，吉。\n后天卦：官运亨通，求财不成。佐才平安（辅佐），主官多病灾。\n流年卦：官人逢有升迁，疾病有救。求财短期有利，长期凶。婚事必成，落第科甲，生女。\n\n【卦占卜故事】风山渐䷴此卦齐晏子应举，卜得之，后果为丞相也。\n\n【卦象图解】图中：一望竽在爽高处，一药炉在地，一官人登梯， 一枝花在地上。\n高山植木之课 积小成大之\n\n【卦图象解】一、一望竿在爽高处：家人望归象。 \n二、 一药炉在地：平安，无灾也。 \n三、一官人登梯：升官之象，衣锦还乡也，棺也。 \n四、一枝花在地：落第象，不久之象。\n\n【卦义解读】九三阳刚居下卦之上，即将进入上卦，意 言，人之将"
  },
  {
    "id": 54,
    "name": "雷泽归妹",
    "hexagramSymbol": "䷵",
    "yaos": [
      "阳",
      "阳",
      "阴",
      "阳",
      "阴",
      "阴"
    ],
    "yaoci": [
      "初九：归妹以娣，跛能履，征吉。",
      "九二：眇能视，利幽人之贞。",
      "六三：归妹以须，反归以娣。",
      "九四：归妹愆期，迟归有时。",
      "六五：帝乙归妹，其君之袂，不如其娣之袂良，月几望，吉。",
      "上六：女承筐无实，士刲羊无血，无攸利。"
    ],
    "divinationDiagramName": "雷泽归妹象解",
    "divinationDiagram": "官人骑鹿指云，小鹿子在后，望竿上有文字，人落刺中， 一人拔出。\n浮云蔽日之课 阴阳不交之",
    "explanation": "【卦象描述】雷泽归妹䷵ 现代人为艾滋病所苦，目前医学界虽仍无法认定其必由同性恋 传染来的，我也不否定其是否正确，但可以肯定的是，其行为必不 为父母所能接受的，此局无人发现，自古以来因道德束缚力很强， 家族同住，故较不易发生，史有明载其断袖之癖即言同性恋，但不 似今日之普遍，世界各国皆为此苦恼不已，其实易经中早已明确指 出其从何而来？为何有人如此，有人不苟同？如何化解？男同性恋 出归妹卦，女同性恋出益卦、旅卦、渐卦、鼎卦等变化较多，其化 解只须正位即可改变。 \n一、 男同性恋，父母烦忧，终致离家出走。（视频：雷天大壮卦解之。） \n二、 委曲以求禄。 \n三、 无婚。 \n四、 诸事不顺，但多才多艺，走艺术路线佳。\n\n【命理解析】雷泽归妹䷵2412850\n先天卦：二男二女并行，父母不全。盖头高人，成正格。财官双美。｛倪注：成正格的人都很好。｝商机大利，左右进财，求官不利。婚主二妻，女主日不出头。\n后天卦：浮云蔽日，弃公从商。子从父业，荫泽大。防金刀人约束。火人大贵。\n流年卦：财禄丰收，求婚不利。（二男二女并行利）投金不利，盖头高人吉。\n\n【卦占卜故事】雷泽归妹䷵此卦舜娶尧二女，卜得之，乃知卑幼不宁 也。\n\n【卦象图解】图中：官人骑鹿指云，小鹿子在后，望竿上有文字，人落刺中， 一人拔出。\n浮云蔽日之课 阴阳不交之\n\n【卦图象解】一、官人骑鹿指云：浮云蔽日，乘乱而欲进。 \n二、小鹿子在后：生意人，随从状。 \n三、望竿上有文字：旦夕而亡，揭竿而起，正名也。 \n四、人落刺中：如鲠在喉，去之不得。 \n五、一人拔出：一人相救示宠状。（视频：因为是归妹卦。） \n六、此卦问病凶，问财吉，问政凶。"
  },
  {
    "id": 55,
    "name": "雷火丰",
    "hexagramSymbol": "䷶",
    "yaos": [
      "阳",
      "阴",
      "阳",
      "阳",
      "阴",
      "阴"
    ],
    "yaoci": [
      "初九：遇其配主，虽旬无咎，往有尚。",
      "六二：丰其藓，日中见斗，往得疑疾，有孚发若，吉。",
      "九三：丰其沛，日中见沫，折其右肱，无咎。",
      "九四：丰其薜，日中见斗，遇其夷主，吉。",
      "六五：来章，有庆誉，吉。",
      "上六：丰其屋，蔀其家，窥其户，阕其无人，三岁不觌，凶。"
    ],
    "divinationDiagramName": "雷火丰象解",
    "divinationDiagram": "竹简灰起，龙蛇交错者，官人着衣裳立，一合子，人吹笙竿，脚踏虎。\n日丽中天之课 藏暗向明之",
    "explanation": "【卦象描述】雷火丰䷶ 此卦常出现在儿子身上 \n一、 未经本派之人指点，乃自然居此局中之人，其与同时生 人不同，婚事必先成后破。\n二、科甲考试顺利。 \n三、 性刚且坚，易与人争，必为感情困扰。 \n四、 从商必破财。 \n五、 从官职吉。\n\n【命理解析】雷火丰䷶2413300\n先天卦：虎蛇龙三人，先聚后散，外实内虚。官运不明，进退两难。致丰之道，不求则丰。龙蛇之年变化多，父夫受累，外喜内忧。独利工艺，无人争利。\n后天卦：夫妻凶，外喜内忧。商机不利，防破损。识人不明，时机丧失。\n流年卦：贵人小人同时在侧，外喜内忧。官事受累，诸事不宜进，财破。\n\n【卦占卜故事】雷火丰䷶此卦庄周说剑，临行卜得之，果得剑也。\n\n【卦象图解】图中：竹简灰起，龙蛇交错者，官人着衣裳立，一合子，人吹笙竿，脚踏虎。\n日丽中天之课 藏暗向明之\n\n【卦图象解】一、竹简灰起：简姓，竹有顺象，坚节不变之象，灰起，中空之象。 （视频：无眉毛为中空之面象。）\n二、龙蛇交错：辰巳之年，正邪相争，蛇虺乃毒谋暗算也。 \n三、官人着衣裳立：官人（视频：先破后成。）、倌人、丈夫也，藏于内也。 \n四、一合子：先成后破。 \n五、人吹笙竿：闲情逸志，主喜事临门。 \n六、脚踏虎：临危不乱也，险在下也。 \n七、旱沼之旁：心力交瘁也。 \n八、池中无水：旱象，破财也。 \n九、珠落盘中：先聚后散也。\n\n【卦义解读】六二乃柔将其位，又居明卦之中，为至明 之才，但因所遇之君不明，而无法下求于己， 若居丰时，意往而求其君能明己才，必招致猜 妒疑惑。惟有尽己之至诚，以求其感而能发， 则君之昏蒙可开，如此则吉矣。 象曰：有孚发君，信以发志也。 用己之至诚孚实，以求发"
  },
  {
    "id": 56,
    "name": "火山旅",
    "hexagramSymbol": "䷷",
    "yaos": [
      "阴",
      "阴",
      "阳",
      "阳",
      "阴",
      "阳"
    ],
    "yaoci": [
      "初六：旅琐琐，斯其所取灾。",
      "六二：旅即次，怀其资，得童仆贞。",
      "九三：旅焚其次，丧其童仆，贞厉。",
      "九四：旅于处，得其资斧，我心不快。",
      "六五：射雉，一矢亡，终以誉命。",
      "上九：鸟焚其巢，旅人先笑后号咷咷咷咷，丧牛于易，凶。"
    ],
    "divinationDiagramName": "火山旅象解",
    "divinationDiagram": "三星者，贵人台上垂钓牵水畔人，一猴一羊，大溪者。\n始鸟焚巢之课 欢极哀生之",
    "explanation": "【卦象描述】火山旅䷷ 此局特殊，学者须识。 \n一、 科甲兴旺 \n二、 女身男态 \n三、 婚事不成，须逢肖羊、肖猴或于未、申之年方有成。 \n四、 城府较深，终自取咎。（视频：城府很深之人手象手纹很深，因随时握拳算计别人。对付城府深之人不用理他便可平安无事。）\n\n【命理解析】火山旅䷷2420110\n先天卦：生为公门人，中年前（45岁）平步青云。逢猴逢羊成格，大利西南，外动频。猴得长一人相助。逢羊开泰，位列三台。\n后天卦:位近三台（两院院长）。贵人不求自来。离野入朝，未中（未年）得利。逢猴、羊主利，防乐极生悲。\n流年卦：升迁在八月，大利西南。不利婚事和求财。女命逢之，须防一目人（姓中有目）。逢猴、羊，须忌有险。本命是猴、羊反之大吉。\n\n【卦占卜故事】火山旅䷷此卦陈后主得张丽华，卜得之，乃知先喜 后悲。\n\n【卦象图解】图中：三星者，贵人台上垂钓牵水畔人，一猴一羊，大溪者。\n始鸟焚巢之课 欢极哀生之\n\n【卦图象解】一、三星者：三台贵人，相位之人。 \n二、贵人台上垂钓：君主相求，老板相求人才。 \n三、牵水畔人：贤能之人，离野入朝封候。或慕权势而变志（节）（视频：卜到此卦不要讲出来，有些天机不可泄露。）。 \n四、一猴一羊：肖猴，肖羊，候、杨姓人，未申年应之。 \n五、大溪：脱险也，港口也，水侧也。"
  },
  {
    "id": 57,
    "name": "巽为风",
    "hexagramSymbol": "䷸",
    "yaos": [
      "阴",
      "阳",
      "阳",
      "阴",
      "阳",
      "阳"
    ],
    "yaoci": [
      "初六：进退，利武人之贞。",
      "九二：巽在床下，用史巫纷若，吉，无咎。",
      "九三：频巽，吝。",
      "六四：悔亡，田获三品。",
      "九五：贞吉，悔亡无不利，无初有终，先庚三日，后庚三日，吉。",
      "上九：巽在床下，丧其资斧，贞凶。"
    ],
    "divinationDiagramName": "巽为风象解",
    "divinationDiagram": "贵人赐衣，一人跪受，云中雁传书， 人在虎下坐。一人射虎中箭，虎走。\n风行草偃之课 上行下放之",
    "explanation": "【卦象描述】巽为风䷸ 此局大利未婚女，吾每逢有未婚小姐来求教，都不厌其烦的希 望他能住在此局中，必主婚姻幸福。 \n一、 科甲兴旺，考试必中。 \n二、 逢凶化吉，灾事不兴。 \n三、 婚姻必能嫁好夫婿，逢红鸾即动。 \n四、 性情稳定，处忧不惧。 \n五、 健康平安之人。\n\n【命理解析】巽为风䷸2420625\n先天卦：三人之中伤一人，三才防虎又防寅。正官带印，安份守纪。见机而进，不招耻辱。｛倪注：所谓机，量力而进也。｝\n后天卦：出将入相，临受禄命，须防暗箭。虎人难逃，其它（生肖人）平安。女命逢之防暗害，吉中有险，夫有难。\n流年卦：虎人招害，诸事先成后破。知止方吉。科甲高中，婚事不逢寅可成。五短人（矮人）大吉，诸事顺遂。\n\n【卦占卜故事】巽为风䷸此卦范蠡辞官入湖，卜得之，乃知越国不久\n也。\n\n【卦象图解】图中：贵人赐衣，一人跪受，云中雁传书， 人在虎下坐。一人射虎中箭，虎走。\n风行草偃之课 上行下放之\n\n【卦图象解】一、贵人赐衣：先破后成象。 \n二、 一人跪受：贵绶也。如占疾病，则主寿衣，凶象。 \n三、云中雁传书：意外喜讯。 \n四、人在虎下坐：身处险而不知。 \n五、一人射虎中箭：贵人相救。 \n六、虎走：脱险，寅年也。 又虎乃有威望之人，利武官，主人在虎边进退不得之时。亦言虎将须知功成身 退，否则暗箭难防，以明哲保身为吉。\n\n【卦义解读】巽之重卦，有"
  },
  {
    "id": 58,
    "name": "兑为泽",
    "hexagramSymbol": "䷹",
    "yaos": [
      "阳",
      "阳",
      "阴",
      "阳",
      "阳",
      "阴"
    ],
    "yaoci": [
      "初九：和兑，吉。",
      "九二：孚兑，吉，悔亡。",
      "六三：来兑，凶。",
      "九四：商兑未宁，介疾有喜。",
      "九五：孚于剥，有厉。",
      "上六：引兑悦之至极则愈悦，故言引兑。"
    ],
    "divinationDiagramName": "兑为泽象解",
    "divinationDiagram": "人坐看一堆担，月在天边，秀才登梯，一女在合边立，文字上箭。\n江湖养物之课 天峰雨泽之",
    "explanation": "【卦象描述】兑为泽䷹ \n一、 求婚事必不成，感情复杂又专一不二，如遇虎狼之人必伤害甚大。 \n二、 有待婚中，夫凶之象，婚比同时生人，延后三年。 \n三、 科甲顺畅，多才艺之女。 \n四、 公职顺遂，但从商必主不利。 \n五、 体健无灾，母荫重，有无父之虞。\n（视频：如果共有六女都没有结婚，1=3，2=4.3=6相对位。）\n\n【命理解析】兑为泽䷹2421130\n先天卦：双亲有三人，生有四粒珠。此人身有科，尽是自由人。婚姻有破，婆媳不和是定数。\n后天卦：遇名师，不登青云，也做商人。逢女有破，有妻生灾。桃李满天下。女命则求合吉，一夜孤行，枯坐到老。\n流年卦：金榜登科，事业停滞。唯儒林人发，为一方之主（如校长）。\n\n【卦占卜故事】兑为泽䷹此卦唐三藏去西天取经，卜得之，乃知必 归唐国。\n\n【卦象图解】图中：人坐看一堆担，月在天边，秀才登梯，一女在合边立，文字上箭。\n江湖养物之课 天峰雨泽之\n\n【卦图象解】一、人坐看一担：任务完成状，有人相助象，助人为乐之贵人。 \n二、月在天边：清明之治。 \n三、秀才登梯：金榜登科象。 \n四、一女在合边立：女人介入，先成后破。 \n五、文字上箭：得机而发，射：发之象。"
  },
  {
    "id": 59,
    "name": "风水涣",
    "hexagramSymbol": "䷺",
    "yaos": [
      "阴",
      "阳",
      "阴",
      "阴",
      "阳",
      "阳"
    ],
    "yaoci": [
      "初六：用拯马壮，吉。",
      "九二：涣奔其机，悔亡。",
      "六三：涣其躬，无悔。",
      "六四：涣其群，元吉。",
      "九五：涣汗其大号，涣王居，无咎。",
      "上九：涣其血，去逖出，无咎。"
    ],
    "divinationDiagramName": "风水涣象解",
    "divinationDiagram": "山上有寺，一僧，一人随后，一鬼在后，金甲人。\n顺水行舟之课 大风吹物之",
    "explanation": "【卦象描述】风水涣䷺ 涣局亦常见之，吾人利用风卦可立解。 \n一、心在宗教，不想结婚，但易入邪道。 \n二、心中有鬼，诸事不成。 \n三、祸事连连，官非牢狱灾难免。 \n四、出家化解灾厄，母亲终日担忧。\n\n【命理解析】风水涣䷺2421900\n先天卦：生俱慈悲心，莫恨人生害。（不是人慈悲就没有人陷害）山桥曲转，八千女鬼（魏姓），革故鼎新路是阻。好事多磨，终成眷属，在二八之年。\n后天卦：莫恨妻儿无缘份，命中唯带一孤神。婚姻长短前身定。月缺花残数不晓。（不须看数）\n流年卦：患难将散，利涉大川。顺行而动，夫妻对峙。僧贵防鬼，（僧去人为曾）烟消云散。\n\n【卦占卜故事】风水涣䷺此卦汉武帝，卜得之，乃知李夫还魂也。\n\n【卦象图解】图中：山上有寺，一僧，一人随后，一鬼在后，金甲人。\n顺水行舟之课 大风吹物之\n\n【卦图象解】一、山上有寺：出家状，对峙状，寸土寸金象。 \n二、僧：化外之人，光头人，曾姓人。 \n三、一人随后：逃避，求助化外之人。 \n四、一鬼在后：为祸追缉之象，内心有鬼，处事不明象。(视频：羊眼、猪眼、醉眼之人大恶。) \n五、金甲人：正义之师，得民心也。 \n六、寺，土头人作对。等待时机也。\n\n【卦义解读】涣之道所以可致亨，以卦来言，用阳刚之法，不可致极刚，以居下位，又得中道，柔位而 得"
  },
  {
    "id": 60,
    "name": "水泽节",
    "hexagramSymbol": "䷻",
    "yaos": [
      "阳",
      "阳",
      "阴",
      "阴",
      "阳",
      "阴"
    ],
    "yaoci": [
      "初九：不出户庭，无咎。",
      "九二：不出门庭，凶。",
      "六三：不节若，则嗟若，无咎。",
      "六四：安节，亨。",
      "九五：节，吉，往有尚。",
      "上六：苦节，贞凶，悔亡。"
    ],
    "divinationDiagramName": "水泽节象解",
    "divinationDiagram": "大雨下，火中鱼跃出，鸡在屋上，犬在井中，屋门开着。\n船行风黄之课 寒暑有节之",
    "explanation": "【卦象描述】水泽节䷻ \n一、本人肖鸡，则必大贵。 \n二、本人肖犬，则以小做大，招自陷。 \n三、财无积余，行险招凶。 \n四、婚事不成，犬人遇鸡则成，妻长一岁，与同时生人不同，且妻 主大贵，助夫渡厄。（视频：鸡者机也，逢鸡则生。）\n\n【命理解析】水泽节䷻2422310\n先天卦：财帛丰发，天意从酉（鸡），门庭吉庆。父吉母凶，财散无常，遇犬加凶。商机逢酉大利，开门得财，犬生暗害，余吉。鸡独犬四数中定。夫凶妻吉。\n后天卦：酉人重立门户，且吉，得父资助。犬人自陷，皆不出节（节为节制、法度）。唯鸡可救。\n流年卦：哭笑不得，进退失据，夫凶妻吉。逢鸡逢酉重生，逢犬陷井不拔。\n\n【卦占卜故事】水泽节䷻此卦是孟姜女送寒衣，卜得之，知夫落亡 不吉之兆。\n\n【卦象图解】图中：大雨下，火中鱼跃出，鸡在屋上，犬在井中，屋门开着。\n船行风黄之课 寒暑有节之\n\n【卦图象解】一、大雨下：阴暗不明，凶象。 \n二、火中鱼跃：飞腾而徒劳无功，又餐饮业。 \n三、鸡在屋上：酉年肖鸡人，解救之时与人。 \n四、犬在井中：招陷，动弹不得，不知节制而招如此。 \n五、屋门开着：仍可开张，须鸡人来助大吉。\n（视频：老祖宗定的节日，如中秋节，端五节，春节……，目的就是让民众情绪缓和一下，即使有不满情绪过节时也不会上街游行。 ）\n\n【卦义解读】此以卦才言，外险内悦，以能悦且又知止，此为节之大义，常人于悦时不知止，遇艰险方 思止。当位居尊之人如明节之道，必能中正且亨通矣。今人之权力欲望无尽，居尊不思止，悦 而无限，终必至凶，乃不知节之道，明矣。 天地节而"
  },
  {
    "id": 61,
    "name": "风泽中孚",
    "hexagramSymbol": "䷼",
    "yaos": [
      "阳",
      "阳",
      "阴",
      "阴",
      "阳",
      "阳"
    ],
    "yaoci": [
      "初九：虞吉。",
      "九二：鸣鹤在阴，其子和之，我有好爵，吾与尔靡之。",
      "六三：得敌，或鼓或罢，或泣或歌。",
      "六四：月几望，马匹亡，无咎。",
      "九五：有孚孪如，无咎。",
      "上九：翰音登于天，贞凶。"
    ],
    "divinationDiagramName": "风泽中孚象解",
    "divinationDiagram": "望子上文书，人击柝，贵人用绳牵鹿 雁啣书。\n鹤鸣子和之课 事有定期之",
    "explanation": "【卦象描述】风泽中孚䷼ 有女每试必为状元，即生此局之人 \n一、科甲状元，每考必中。\n二、武职大利，女中豪杰，今见有女司法官如此。 \n三、双喜同临，常在婚姻中伴之而来金榜登科。 \n四、喜事初不成，家中不同意，后成。但与同时生人延后三年。\n\n【命理解析】风泽中孚䷼2422810\n先天卦：兄弟分家，不相往来。父财必争。从官大吉，武为司法，文为财官（如金融界）。科名并茂，犹有一子主是非。婚事成于财货，凶于财货。后天卦：望子上文书，节制财帛防人害。舍禄求官为上策。夫妻本是前世修，何必为财起争执。\n流年卦：科甲大吉，禄受限，须防子劫。喜出望外之年，双喜临门。\n\n【卦占卜故事】风泽中孚䷼此卦辛君屯边，卜得之，遂果得梅妃之信\n也。\n\n【卦象图解】图中：望子上文书，人击柝，贵人用绳牵鹿 雁啣书。\n鹤鸣子和之课 事有定期之\n\n【卦图象解】一、望子上文书：科甲高中，刑法更吉。 \n二 、人击柝：预警也。 \n三、贵人用绳牵鹿：守成，不可攻也。 \n四、雁啣书：喜事将至，有南徙之象。 \n五、人立庭中：莅庭也，防官司或打官司保身也。 \n（视频：真心诚意的人说话时手是上下摆动的，虚情假意的人说话时是左右摆动的。）"
  },
  {
    "id": 62,
    "name": "雷山小过",
    "hexagramSymbol": "䷽",
    "yaos": [
      "阴",
      "阴",
      "阳",
      "阳",
      "阴",
      "阴"
    ],
    "yaoci": [
      "初六：飞鸟以凶。",
      "六二：过其祖，遇其妣，不及其君，遇其臣，无咎。",
      "九三：弗过防之，从或戕之，凶。",
      "九四：无咎，弗过遇之，往厉必戒，勿用永贞。",
      "六五：密云不雨，自我西郊，公弋取彼在穴。",
      "上六：弗遇过之，飞鸟离之，凶，是谓灾眚。"
    ],
    "divinationDiagramName": "雷山小过象解",
    "divinationDiagram": "明月当空，林下一人弹冠，人在网中。一人割网，猴子在山头出。\n飞鸟遗音之课 上逆下顺之",
    "explanation": "【卦象描述】雷山小过䷽ 此局很多，吾人常不自知陷于局中。 \n一、感情困扰，摆脱不了情关，为情不顾一切，此小人也。 \n二、肖猴，候姓人不忌。 \n三、无法工作，神魂颠倒。 \n四、常过失伤人，故婚事不成。\n\n【命理解析】雷山小过䷽2423200\n先天卦：父母双全，财禄临身，次女成格。婚事逢田凶，重新开始，又逢田有解。(田：戴、陈、潘)余为官星，公教可成，唯防婚约。有女无子。\n后天卦：官讼之后，重新开始，母荫临身。单身贵，单新养女，有婚反凶。\n流年卦：防火厄，夫妻不和，陷入网中。唯有强力可解，财不缺。女人逢之主不利，加凶。\n\n【卦占卜故事】雷山小过䷽此卦汉君有难，卜得之，后果脱险也。\n\n【卦象图解】图中：明月当空，林下一人弹冠，人在网中。一人割网，猴子在山头出。\n飞鸟遗音之课 上逆下顺之\n\n【卦图象解】一、明月当空：政清状，入法庭，刑堂。 \n二、林下一人：林姓人。 \n三、人陷网中：不得脱身，受束缚。 \n四、一人弹冠：求去之象，但求去为形，束缚为神，合则有表里不一状。 （视频：小人易进难出。）\n五、一人割网：贵人解救，脱困状。 \n六、猴子在山头：从新开始之课(候再出山)。\n\n【卦义解读】咎。于其他之卦，越过本位凶，但今于小过， 乃意当过之时，可过，无灾，切忌失君臣之道， 及过之太过，反凶。 象曰：不及其君，臣不可过也。 下臣遇须过之时，可过越其"
  },
  {
    "id": 63,
    "name": "水火既济",
    "hexagramSymbol": "䷾",
    "yaos": [
      "阳",
      "阴",
      "阳",
      "阴",
      "阳",
      "阴"
    ],
    "yaoci": [
      "初九：曳其轮，濡其尾，无咎。",
      "六二：妇丧其茀，勿逐，七日得。",
      "九三：高宗伐鬼方，三年克之，小人勿用。",
      "六四：繻繻繻繻有衣袽袽袽袽，终日戒。",
      "九五：柬邻杀牛，不如西邻之禴禴禴禴祭，实受其福。",
      "上六：濡其首，厉。"
    ],
    "divinationDiagramName": "水火既济象解",
    "divinationDiagram": "人在岸上一船来，一堆钱，云中雨下，二小儿在雨中行，文书一策。\n舟楫济川之课 阴阳配合之",
    "explanation": "【卦象描述】水火既济䷾ 此局吾常用于化解困卦之局 （视频：天机道\"人安其位时不要进。\"）\n一、不重财货，天性如此。 \n二、官运人吉，从商亦得财，故财官双美。 \n三、科甲亦吉，利考试。 \n四、先有子，后有婚，如加上命中有妾，则必主正房一子，偏 房一子。 \n五、婚姻会比同时生人慢八年，也常先有妾后有婚。 故吾人知如此，常俟事业安定后，用雷卦化解婚姻问题。\n\n【命理解析】水火既济䷾2430110\n先天卦：求官求求科，两相宜，少年登科。逢水得财命中定（渔业等）两兄弟得祖业。受禄命于水年（戊亥）。婚事吉，男有子，女无。\n后天卦：得贵人助，求财大吉。求官亦得禄命，一人二水解灾。戊亥年现济，平步青云，遂己志。\n流年卦：有窃之年，禄命至，吉中小凶。夫妻和睦，防妻有病灾，迁调外地。\n\n\n【卦占卜故事】水火既济䷾此卦季布在周家潜藏，卜得之，遂遇高皇\n帝\n图中：人在岸上一船来，一堆钱，云中雨下，二小儿在雨中行，文书一策。\n\n【卦象图解】图中：人在岸上一船来，一堆钱，云中雨下，二小儿在雨中行，文书一策。\n舟楫济川之课 阴阳配合之\n\n【卦图象解】一、人在岸上：泣也，等待也，无目的也。 \n二、 一船来：接引至也。 \n三、一堆钱：财禄无用也，忧心忡忡也，有窃象，抄家之象。 \n四、云中雨下：阴中有果也，夜间至凌晨时。 \n五、二小儿：主喜也，二人也，二人雨中行也。 \n六、文书一策：证件，命令也，资料也。"
  },
  {
    "id": 64,
    "name": "火水未济",
    "hexagramSymbol": "䷿",
    "yaos": [
      "阴",
      "阳",
      "阴",
      "阳",
      "阴",
      "阳"
    ],
    "yaoci": [
      "初六：濡其尾，吝。",
      "九二：曳其轮，贞吉。",
      "六三：未济，征凶，利涉大川。",
      "九四：贞吉，悔亡，震用伐鬼方，三年有赏于大国。",
      "六五：贞吉，无悔，君子之光，有孚，吉。",
      "上九：有孚于饮酒，无咎，濡其首，有孚失是。"
    ],
    "divinationDiagramName": "火水未济象解",
    "divinationDiagram": "一人提刀斧， 一虎坐，一旗卓在山上，一人取旗，梯子有到字。\n碣火求珠之课 忧中望喜之",
    "explanation": "【卦象描述】火水未济䷿ \n一、女身男态，性刚易怒。 \n二、肖虎女子，必枯坐无成。 \n三、刘、宋、高等姓人从武，吉。 \n四、婚事必不成，与同时生人婚时不同。 \n五、从商求财是非多，甚而官司、争执不下。\n 阳宅之局演绎到此，暂告一段落，下篇风不水篇，其中吾人已 将古来很复杂之理论简化后，并用易来解释计算，学者必能极易明 了，加上录像带之说明，必可一罗经在手，即堪天与地去也。 导言 导言 导言 导言 我们中国人，注重慎终追远，祭祀祖先为孝道之一，祖先们遗 留下来很宝贵的风水经验，今人已渐就淡忘，殊不知自古以来此风 水之学，不但只是用在阴宅之安葬，使后代子孙兴旺上，更用在兵 法上，地形篇多有论及，如误犯之，乃兵家大忌，生死关头，一念 之间，天地反覆，阴符经云‘天发杀机，龙蛇起陆，人发杀机，天 地反覆。’我举一些简单的例子，给学者参考。姜太公云‘法天结 营，外物不能侵害’，其要求手下出军征战，安营下寨，必要布列 军阵，有几个法门不可违反。 将帅领导者，居九天之上，即东方青龙位，定好之后，十日之 后，再开牙门，即军营大门。常背建向破，建为北斗七星之柄向，\n\n【命理解析】火水未济䷿2430520\n先天卦：虎王之人受桎梏。卯卓宋高得利人。高台倾覆。婚事不成反招凶。求财求官两不利。一生武官，文大利。余不吉，乱世当出。夫妻不和争执多，兵戎相见。有女为贵。\n后天卦：东南西北，居无定所。凡事缺临门一脚，踏谷扬旗终凶。不贪不吝，正财可守终身。忧中见喜。\n流年卦：未济之年，事多雍滞。慎处，守成吉。力争招是非。婚事不利，求财谨慎多防。虎人受困之时。\n\n\n【卦占卜故事】火水未济䷿此卦孔子穿九曲明珠未彻，卜得之，乃遇 二女方始得穿也。\n\n【卦象图解】图中：一人提刀斧， 一虎坐，一旗卓在山上，一人取旗，梯子有到字。\n碣火求珠之课 忧中望喜之\n\n【卦图象解】一、一人提刀斧：刘姓，武官，手有生杀之权。 \n二、 一虎坐：肖虎人，王姓，虎坐乃无威之象。 \n三、一旗卓在山上：揭竿而起，正义之师。 \n四、一人取旗：代替也，高姓，宋姓，其人取代之象。 \n五、梯子有至字：无刀曰至，桎梏受困象，\n六、（附注：峪：谷姓。旗扬：杨姓。)有谷、 杨合乃招凶象。\n\n【卦义解读】居未济之时，柔居相位，在下卦之"
  }
]